{
  "articles": {
    "results": [
      {
        "uri": "8337770530",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:34:41",
        "dateTime": "2024-09-26T08:34:41Z",
        "dateTimePub": "2024-09-26T08:34:23Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://www.thehansindia.com/tech/smartphone-trends-2024-what-to-expect-from-the-latest-models-909937",
        "title": "Smartphone Trends 2024: What to Expect from the Latest Models",
        "body": "The world of smartphones has come a long way since the earliest touch devices hit the market 15 years ago.\n\nThe world of smartphones has come a long way since the earliest touch devices hit the market 15 years ago. What started as a luxury item back then has become an essential piece of technology today. From Steve Jobs' unveiling of the iPhone in 2007 to the newest, more powerful AI-driven devices, smartphones have redefined how we communicate, work, and entertain ourselves today.\n\nAs we approach the end of 2024, expect yet another leap forward in the smartphone industry. This year's innovations promise better performance and new experiences that will make even budget devices exciting to hold.\n\nLet us look at what features will be available in smartphones in 2024 and how budget mobiles under Rs. 30,000 will bring these ground-breaking features to consumers. To make your purchase even more affordable, use the Bajaj Finserv EMI Network Card and shop on Easy EMIs.\n\nOne of the highlights of smartphone technology in 2024 is the use of on-device AI. Gone are the days when you needed a constant internet connection for ineffective AI capabilities. Smartphones like the Samsung Galaxy S24 and iPhone 16 have introduced features like real-time translation, article summaries, and AI-enabled photo editing, which work natively on the phone. This means that you can access these tools even when you are not connected.\n\nFor budget-conscious users, devices like the realme 12 Pro+ and Nothing Phone 2a Plus are beginning to incorporate similar on-device AI functionalities. While they may not match the flagship experience in sheer AI power, their AI-assisted cameras and voice features are nowhere behind the top-tier technology.\n\nBetter display tech is coming to budget phones\n\nSmartphone manufacturers are beginning to bring cutting-edge display technologies to devices aimed at budget-conscious buyers. While foldable screens, pioneered by devices like the Samsung Galaxy Z Fold5, are yet to become affordable, they set the standard for how we interact with our phones. Foldable displays offer larger screens without compromising portability.\n\nMoreover, brands are developing energy-efficient OLED panels that deliver stunning visuals and consume less power, increasing battery life. Budget phones are also benefiting from these innovations in screen quality, and devices like the realme 11 are now offering high refresh rates and vivid colours, making top-tier display technology more accessible to customers.\n\nFoldable phones are dropping in price\n\nFoldable phones are making their way back once again, but their high price tags have kept them out of reach for most consumers. However, 2024 might be the year when foldable technology trickles down to more affordable devices. Brands like Motorola, which once brought stylish devices like Moto Razr to the market, have already released the Razr 40 at competitive prices, and rumours suggest that Samsung is working on foldable models that might be priced below Rs. 30,000.\n\nWhile we do not have foldable mobiles under Rs. 30,000 in India, we can expect manufacturers to focus on developing more affordable options by late 2024.\n\nDSLR-grade camera technology is coming to smartphones\n\nThis year, the Samsung Galaxy S24 Ultra and Xiaomi 14 Ultra have changed our expectations of what smartphone zoom can achieve with periscope lenses, providing crisp, detailed zoom shots. While flagship devices lead this trend, budget smartphones are catching up fast.\n\nTake the realme 12 Pro+ for instance. Priced under Rs. 30,000, this phone offers a telephoto lens capable of decent zoom functionality, along with strong low-light performance. Similarly, the Redmi Note 13 Pro+ offers an excellent 200MP main camera and solid optical zoom, making high-quality photography accessible at a lower price point.\n\nYour phone battery will last longer\n\nOne of the most common gripes that users have with smartphones is poor battery life. In 2024, we are already seeing improvements in this area, with brands bringing larger batteries and more efficient processors. Phones like the OnePlus Nord 4 and POCO F6 5G feature 5,000 mAh batteries or more, ensuring all-day performance even with heavy use.\n\nSmartphone manufacturers are also working on new battery materials that charge faster and discharge slower, enhancing longevity and charging speed. Apple has been a leader in this, with a longer-lasting battery stealing the spotlight in the latest iPhone 16.\n\nWhat to expect from budget smartphones under Rs. 30,000\n\nIn 2024, several budget phones under Rs. 30,000 have attracted buyers looking for features that have been limited to high-end devices. Some of them include:\n\n● realme 12 Pro+: Priced at around Rs. 25,000, it offers a powerful camera setup, IP65 water and dust resistance, and strong battery life. It's a solid contender for anyone looking for top-notch features without a premium price tag.\n\n● Nothing Phone 2a Plus: With its transparent design and improved Glyph interface, the Nothing Phone 2a Plus provides a unique, standout experience at Rs. 27,999.\n\n● OnePlus Nord 4: Offering near-flagship experiences, the Nord series continues to shine with the Nord 4, priced just under Rs. 30,000. It includes a Snapdragon 7+ Gen 3 processor, which handles gaming and multitasking effortlessly.\n\n● Samsung Galaxy F54 5G: Priced at Rs. 25,999, this device packs a 108MP camera and a huge 6,000 mAh battery, perfect for those who need long-lasting power without compromising on camera quality.\n\n● Redmi Note 13 Pro+: Offering a 200MP camera and a powerful MediaTek Dimensity 7200-Ultra processor, this phone is a beast for its price. At Rs. 25,629, it's a solid option for those looking for camera prowess in a budget-friendly package.\n\nDeals and offers on the latest smartphones on the Bajaj Finserv EMI Network\n\nWhether you are buying a flagship device or a more affordable model, you can make your purchase more accessible and budget-friendly when you shop on the Bajaj Finserv EMI Network. You can grab your dream device on Easy EMIs and benefit from exclusive perks like cashback and offers. For example, if you choose EMI plans with tenures of 10, 9, 8, 7, and 6 months while shopping for the last smartphones, you can enjoy the zero down payment offer on select models.\n\nIf you are looking for lower monthly EMIs, you can opt for the lowest EMI schemes that split your purchase into 24 EMIs (with 8 months' down payment), 18 EMIs (with 6 months' down payment), 17 EMIs (with 5 months' down payment, 15 EMIs (with 3 months' down payment), or 8 EMIs (with 2 months' down payment).\n\nHow to buy smartphones using the Bajaj Finserv EMI Network Card\n\nPurchasing your new smartphone is effortless and simple while shopping on the Bajaj Finserv EMI Network. Here's how you can do it:\n\n3. At checkout, provide your Bajaj Finserv EMI Network Card details to the store representative\n\n4. Pick your preferred EMI terms\n\n5. Enter the OTP sent to your registered mobile number to complete the purchase",
        "source": {
          "uri": "thehansindia.com",
          "dataType": "news",
          "title": "The Hans India"
        },
        "authors": [
          {
            "uri": "askari_jaffer@thehansindia.com",
            "name": "Askari Jaffer",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://www.bajajmall.in/smartphones",
          "https://www.bajajmall.in/mobile-under-30000"
        ],
        "image": "https://assets.thehansindia.com/h-upload/2024/09/26/1483816-25-09-featured-image.webp",
        "eventUri": null,
        "sentiment": 0.192156862745098,
        "wgt": 465035681,
        "relevance": 2
      },
      {
        "uri": "8337764707",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:31:42",
        "dateTime": "2024-09-26T08:31:42Z",
        "dateTimePub": "2024-09-26T08:31:26Z",
        "dataType": "news",
        "sim": 0.7372549176216125,
        "url": "https://tech.hindustantimes.com/mobile/news/samsung-galaxy-tab-a9-galaxy-tab-s9-fe-available-at-huge-discounts-during-amazon-great-india-festival-check-det-71727338284396.html",
        "title": "Samsung Galaxy Tab A9+, Galaxy Tab S9 FE+ available at huge discounts during Amazon Great India Festival: Check details",
        "body": "Tablets to fit Rs. 25,000 Budget: Check Samsung Galaxy Tab A9 Plus, Xiaomi Pad 5 to Lenovo Tab P12 and more\n\nAmazon Great Indian Festival Sale is here for Prime members and it brings various discounts across numerous products. Among the highlighted deals, Samsung has reduced prices on two of its popular tablets: the Galaxy Tab A9+ and the Galaxy Tab S9 FE+. The Galaxy Tab A9+ now retails for ₹16,999, while the Galaxy Tab S9 FE+ is available for ₹35,999.\n\nSamsung Galaxy Tab A9+ comes with 8GB of RAM and 128GB of internal storage. This model previously sold for ₹22,999 but now features a significant discount, making it accessible for budget-conscious consumers. On the other hand, the Galaxy Tab S9 FE+, also with 8GB of RAM and 128GB of storage, launched earlier this year at ₹55,999. The current price of ₹35,999 reflects a notable markdown that enhances its market appeal.\n\nAlso read: Vivo X200 Pro Mini officially confirmed ahead of October 14 launch; Here's what to expect\n\nIn addition to the direct discounts, customers can benefit from extra bank offers that could lower the final purchase price further. This sale presents an opportunity for those in the market for either a mid-range or premium tablet.\n\nAlso read: iPhone 16 vs Xiaomi 14: Features, performance, and value compared for your next smartphone purchase\n\nGalaxy Tab S9 FE+ showcases a 12.4-inch WQXGA display, allowing for detailed visual quality. It includes an 8 MP primary camera at the rear and a 12 MP front camera, catering to video calls and photography needs. Powered by the Exynos 1380 processor and running on Android 12, this tablet performs well across various applications. A robust 10090 mAh lithium-ion battery supports long usage hours, making it suitable for entertainment, gaming, reading, and professional tasks. Its large display and strong specifications make it an excellent choice for educational purposes as well.\n\nAlso read: iPhone SE 4 launching soon, may become Apple's most successful phone of 2025: 3 key reasons\n\nConversely, the Galaxy Tab A9+ features an 11.0-inch LCD display with a resolution of 1920 x 1200 WQXGA. It runs on the Qualcomm Snapdragon SM6375 processor, providing dependable performance for everyday activities. The device has an 8 MP rear camera with autofocus and a 5 MP front camera, making it ideal for capturing images and making video calls. Additionally, its quad speakers enhance audio quality, creating an immersive experience. The 7040 mAh battery ensures extended usage for entertainment and productivity.",
        "source": {
          "uri": "tech.hindustantimes.com",
          "dataType": "news",
          "title": "Hindustan Times Tech"
        },
        "authors": [
        ],
        "links": [
          "https://tech.hindustantimes.com/samsung-galaxy-tab-a9-plus-price-in-india-P000039277",
          "https://tech.hindustantimes.com/samsung-galaxy-tab-s9-fe-plus-price-in-india-P000039202",
          "https://tech.hindustantimes.comVivo%20X200%20Pro%20Mini%20officially%20confirmed%20ahead%20of%20October%2014%20launch;%20Here's%20what%20to%20expect",
          "https://tech.hindustantimes.com/mobile/news/iphone-16-vs-xiaomi-14-features-performance-and-value-compared-for-your-next-smartphone-purchase-71727262894138.html",
          "https://tech.hindustantimes.com/mobile/news/iphone-se-4-launching-soon-may-become-apple-s-most-successful-phone-of-2025-3-key-reasons-71727254356344.html"
        ],
        "image": "https://images.hindustantimes.com/tech/img/2024/09/26/1600x900/Samsung_Galaxy_Tab_A9_Plus_1727338509573_1727338509726.jpg",
        "eventUri": "eng-9936421",
        "sentiment": 0.3098039215686275,
        "wgt": 465035502,
        "relevance": 1
      },
      {
        "uri": "8337764324",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:31:30",
        "dateTime": "2024-09-26T08:31:30Z",
        "dateTimePub": "2024-09-26T08:31:12Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://www.geeky-gadgets.com/?p=438801",
        "title": "Apple CarPlay Gets a Major Upgrade in iOS 18: 10 Must-See Features",
        "body": "With the release of iOS 18, Apple CarPlay has undergone significant updates, introducing a range of new features and enhancements designed to elevate the user experience. These changes encompass various aspects of the CarPlay interface, from visual design to functionality, accessibility, and safety features. The updates aim to provide a more intuitive, personalized, and comfortable experience for drivers using CarPlay. The video below gives us a look at the updated Apple CarPlay in iOS 18.\n\nOne of the most notable changes in the updated CarPlay is the redesigned home button, which takes inspiration from the iconic design of the first iPhone. This familiar and user-friendly interface is further enhanced by the introduction of a full-screen mode, maximizing the display area and improving usability. The combination of these two features creates a seamless and efficient navigation experience for users.\n\nIn addition to the redesigned home button and full-screen mode, CarPlay now offers split-screen functionality. This feature allows you to simultaneously display both navigation and audio player on the screen, providing a convenient way to access essential information while driving. You have the flexibility to switch between full-screen and split-screen views, depending on your preferences and needs.\n\nCustomization is another key aspect of the updated CarPlay. You can now personalize your driving experience with customizable wallpapers, including a variety of color options and a dark mode for night driving. These wallpapers can be easily changed through the settings menu, allowing you to tailor the visual appearance of CarPlay to your liking.\n\nTo ensure a distraction-free driving experience, CarPlay introduces a silent mode feature. This mode allows you to mirror your iPhone's silent mode settings or set CarPlay to always be silent, preventing notifications and alerts from interrupting your focus on the road.\n\nSiri, Apple's intelligent assistant, has also received significant improvements in the latest CarPlay update. With enhanced functionality and new animations (not available in Europe), Siri now offers a more engaging and interactive experience. The improved message reading and replying capabilities make it easier to stay connected while driving, allowing you to communicate hands-free.\n\nAccessibility is a crucial consideration in the updated CarPlay, with several new features designed to cater to diverse user needs. Voice control using the iPhone microphone has been integrated, allowing hands-free operation of CarPlay. Sound recognition technology can detect specific sounds, such as car horns or sirens, providing an extra layer of safety and awareness. Additionally, color filters have been introduced to assist users with color blindness or difficulty reading text, ensuring that CarPlay is accessible to a wider range of individuals.\n\nOther notable features in the updated CarPlay include:\n\nTo further enhance the user interface, CarPlay now incorporates bold text, making it easier to read information, especially in bright conditions. The update also includes quick access to recently used navigation and audio apps, allowing for seamless switching between tasks and improving overall efficiency.\n\nThe iOS 18 update for Apple CarPlay represents a significant step forward in terms of functionality, usability, and user experience. With its redesigned interface, enhanced features, and focus on accessibility and safety, CarPlay aims to provide a more enjoyable, personalized, and secure driving experience for iPhone users.",
        "source": {
          "uri": "geeky-gadgets.com",
          "dataType": "news",
          "title": "Geeky Gadgets"
        },
        "authors": [
          {
            "uri": "roland_hutchinson@geeky-gadgets.com",
            "name": "Roland Hutchinson",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://youtu.be/8mZ5xmU9vao",
          "https://www.geeky-gadgets.com/15-iphone-settings-you-should-change/",
          "https://www.geeky-gadgets.com/severance-season-2/",
          "https://www.geeky-gadgets.com/build-your-own-ai-personal-assistant-with-make-chatgpt-and-tally/",
          "https://www.geeky-gadgets.com/awesome-iphone-power-users-tips-tricks/",
          "https://www.youtube.com/watch?v=8mZ5xmU9vao",
          "https://www.geeky-gadgets.com/disclosure-policy/"
        ],
        "image": "https://www.geeky-gadgets.com/wp-content/uploads/2024/09/Apple-CarPlay-3.jpg",
        "eventUri": null,
        "sentiment": 0.3019607843137255,
        "wgt": 465035490,
        "relevance": 3
      },
      {
        "uri": "2024-09-496838254",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:30:02",
        "dateTime": "2024-09-26T08:30:02Z",
        "dateTimePub": "2024-09-26T04:22:00Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://www.inc.com/jason-aten/change-this-1-setting-right-now-to-fix-worst-thing-about-watchos-11.html",
        "title": "Change This 1 Setting Right Now to Fix the Worst Thing About watchOS 11",
        "body": "Just because I start playing a podcast doesn't mean I want it to take over my screen.\n\nAs a general rule, designing software is a delicate balance. You want to introduce new features that will delight your customers, without disrupting the way they already use their devices. If you do introduce a feature or a change to an interface that requires your users to adapt, it better be worth it. Otherwise, you're just going to make people mad--no matter how hard you try to delight them.\n\nAs an example, I would point to watchOS 11, which Apple rolled out last week. Overall, watchOS 11 is a perfectly fine update. If you're using a Series 9 or 10, or an Apple Watch Ultra 2, you gain Sleep Apnea detection. There's also a new Vitals app, as well as a few new watch faces. There is, however, one glaring problem.\n\nThis year, Apple changed the default behavior for Live Activities. Now, they automatically launch when you start playing music or a podcast, for example. Honestly, it's one of my least favorite feature changes Apple has made in a long time.\n\nIn case you've forgotten, Live Activities are a persistent form of notification that allows real-time updates on your devices. So, if you ordered food from Uber Eats, a Live Activity will appear on your iPhone Home Screen to show you the status of your delivery. Or, if you're traveling, an app like Flighty can show you the current status of your flight.\n\nOn the Watch, Live Activities live in a tray called the Smart Stack that you can access by siping up on the screen. It's also where widgets live on the Watch. According to Apple, \"The Smart Stack becomes even more intelligent, providing quick access to the right information, right when you need it with suggested widgets, interactive widgets, and Live Activities.\"",
        "source": {
          "uri": "inc.com",
          "dataType": "news",
          "title": "Inc."
        },
        "authors": [
          {
            "uri": "jason_aten@inc.com",
            "name": "Jason Aten",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://www.inc.com/jason-aten/the-apple-watchs-best-feature-has-1-very-un-apple-like-problem.html",
          "https://www.inc.com/jason-aten/apple-just-announced-apple-watch-series-9-watch-ultra-2-feature-double-tap-gesture.html",
          "https://www.inc.com/jason-aten/if-you-just-bought-a-new-apple-watch-do-this-first.html",
          "https://www.inc.com/jason-aten/starbucks-made-a-simple-but-brilliant-change-to-its-app-that-every-customer-can-appreciate.html"
        ],
        "image": "https://img-cdn.inc.com/image/upload/w_1024,h_576,c_fill/images/panoramic/apple_watch_watchos11_inc_545314_rlaxix.jpg",
        "eventUri": null,
        "sentiment": 0.3098039215686275,
        "wgt": 465035402,
        "relevance": 2
      },
      {
        "uri": "8337759491",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:28:05",
        "dateTime": "2024-09-26T08:28:05Z",
        "dateTimePub": "2024-09-26T08:27:46Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://in.mashable.com/tech/82857/is-your-new-iphone-genuine-heres-how-to-check-your-device-is-real-or-fake",
        "title": "Is Your New iPhone Genuine? Here's How To Check Your Device Is Real Or Fake",
        "body": "Check your new iPhone's authenticity with these simple verification steps.\n\niPhones have become one of the most popular smartphones worldwide, not just for their impressive features but also as a status symbol. In the third quarter of 2024, Apple raked in about $39 billion from iPhone sales, as per reports. However, this skyrocketing demand has also led to a rise in counterfeit models that closely resemble the real thing. While buying from trusted sources like the Apple Store offers some security, purchasing from unauthorized sellers or unverified repair shops can leave you vulnerable to scams. As festive sales approach, the risk of encountering fake products increases. Here's how you can check if your iPhone is authentic.\n\nCheck the Packaging and Accessories\n\nBegin by looking at the packaging and accessories. Apple is known for its meticulous attention to detail, so genuine iPhone boxes are sturdy and feature high-quality images and clear text. If the box feels flimsy or the printing looks off, that could be a warning sign. Also, check that the accessories, like the charging cable, are up to Apple's standards. If you notice poor-quality components or mismatched items, it's likely a counterfeit.\n\nVerify the Serial Number and IMEI\n\nEvery iPhone has a unique serial number and an International Mobile Equipment Identity (IMEI) number. To find the serial number, go to the about section in settings. Once you have it, visit Apple's Check Coverage page and enter the serial number. If it's genuine, the site will show details about your iPhone model, warranty status, and more. To find the IMEI, just dial 06 on your device and compare it to the number on the box and SIM tray. All three should match.\n\nInspect the Build Quality\n\nAuthentic iPhones are crafted with a premium feel. When you hold a genuine device, it should feel solid, with no loose parts or gaps. The buttons should click firmly, and the Apple logo should be perfectly aligned. Pay attention to the overall design and features to ensure they match official specifications. Look for visible flaws, such as rough edges or misaligned logos. A magnifying glass can help you spot any subtle imperfections.\n\nExamine the Software and Features\n\nThe software is another key indicator of authenticity. Genuine iPhones run on Apple's iOS. To check this, go to Settings > General > Software Update to see if you're on the latest version. Counterfeit iPhones often use modified Android systems designed to look like iOS. You can also test Siri; if it doesn't respond when you say \"Hey Siri\" or press the power button, your device might be fake.\n\nVisit an Apple Service Center\n\nIf you still have doubts about your iPhone's authenticity, your best bet is to visit an authorized Apple service center. Professionals there can conduct thorough checks and give you the reassurance you need.\n\nBy following these steps, you can confidently determine whether your iPhone is genuine, ensuring you enjoy the quality and performance that Apple is known for.\n\nSEE ALSO: Flipkart Slashes iPhone 15 Price To Rs 49,999 During Big Billion Days Sale; Check Out Offers",
        "source": {
          "uri": "in.mashable.com",
          "dataType": "news",
          "title": "Mashable India"
        },
        "authors": [
        ],
        "links": [
        ],
        "image": "https://sm.mashable.com/mashable_in/seo/7/79654/79654_d2ej.jpg",
        "eventUri": null,
        "sentiment": 0.03529411764705892,
        "wgt": 465035285,
        "relevance": 6
      },
      {
        "uri": "8337757216",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:26:28",
        "dateTime": "2024-09-26T08:26:28Z",
        "dateTimePub": "2024-09-26T08:26:10Z",
        "dataType": "news",
        "sim": 0.501960813999176,
        "url": "https://www.gadgets360.com/mobiles/news/ios-18-1-public-beta-2-update-iphone-apple-intelligence-features-6653169",
        "title": "Apple Rolls Out iOS 18.1 Public Beta 2 for iPhone With These Features",
        "body": "Control Centre also gets two new dedicated toggles for VPN and Wi-Fi\n\nApple released the iOS 18.1 Public Beta 2 update for iPhone on Wednesday. It carries features powered by Apple Intelligence - the company's artificial intelligence (AI) suite - which it first introduced with the iOS 18.1 Developer Beta update. It includes writing tools, web page summarisation, and an object removal tool for images. Notably, this update was released days after the rollout of the iOS 18.1 Developer Beta 5, and also bundles features like new toggles for the Control Centre, in addition to AI features in the Messages app.\n\nAccording to Apple, the iOS 18.1 Public Beta 2 update introduces Apple Intelligence in Messages. Following the update, users will now be able to get summaries of their unread conversations. They can also choose appropriate quick responses to questions received in messages.\n\niPhone Control Centre is also getting new dedicated toggles for VPN and Wi-Fi. If the user does not like the custom layout of the Control Centre they have created, there's now an option to reset it to the factory layout. A quick shortcut for accessing Apple Intelligence features has been introduced in the Notes app. Users can now access the writing tools directly, instead of the previous method which required highlighting the text and then selecting it from the floating options.\n\nAnother notable addition of the iOS 18.1 Public Beta 2 update is iPhone mirroring with Mac. Users will now be able to drag and drop files between both Apple devices. However, this requires the iPhone and Mac to run on iOS 18.1 Public Beta 5 and macOS Sequoia 15.1 software, respectively.\n\nApple says all iPhone models compatible with the iOS 18 update can download the iOS 18.1 Public Beta 2. However, not all of them will support Apple Intelligence features. The entire iPhone 16 lineup will receive the AI features, in addition to the iPhone 15 Pro and iPhone 15 Pro Max.",
        "source": {
          "uri": "gadgets360.com",
          "dataType": "news",
          "title": "NDTV Gadgets 360"
        },
        "authors": [
        ],
        "links": [
          "https://www.gadgets360.com/apple",
          "https://www.gadgets360.com/tags/artificial-intelligence",
          "https://www.gadgets360.com/mobiles/news/ios-18-1-developer-beta-5-update-iphone-apple-intelligence-messages-features-6636371",
          "https://www.gadgets360.com/tags/apple-intelligence",
          "https://www.gadgets360.com/tags/iphone",
          "https://www.gadgets360.com/mobiles/news/samsung-s24-fe-price-pre-order-page-live-specifications-galaxy-report-6652401",
          "https://www.gadgets360.com/tags/mac",
          "https://www.gadgets360.com/mobiles/news/samsung-m15-5g-prime-edition-price-india-launch-specifications-galaxy-6652250",
          "https://www.gadgets360.com/mobiles/news/samsung-s25-plus-us-variant-geekbench-listing-specifications-galaxy-6648108",
          "https://www.gadgets360.com/tags/ios-18",
          "https://www.gadgets360.com/iphone-16-price-in-india-128234",
          "https://www.gadgets360.com/apple-iphone-15-pro-price-in-india-115761",
          "https://www.gadgets360.com/apple-iphone-15-pro-max-price-in-india-115762"
        ],
        "image": "https://i.gadgets360cdn.com/large/ios_18_1727335486941.jpg",
        "eventUri": "eng-9930586",
        "sentiment": 0.2941176470588236,
        "wgt": 465035188,
        "relevance": 5
      },
      {
        "uri": "8337757081",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:26:21",
        "dateTime": "2024-09-26T08:26:21Z",
        "dateTimePub": "2024-09-26T08:26:06Z",
        "dataType": "news",
        "sim": 0.7764706015586853,
        "url": "https://me.mashable.com/tech/47002/volkswagen-partners-with-google-for-next-gen-mobile-assistant",
        "title": "Volkswagen partners with Google for next-gen mobile assistant",
        "body": "Google is equipping Volkswagen drivers with essential features for an Artificial Intelligence (AI) assistant within a smartphone application.\n\nAlphabet's Google is equipping Volkswagen drivers with essential features for an Artificial Intelligence (AI) assistant within a smartphone application. This initiative aligns with Google's broader strategy to secure business by providing tools for the development of enterprise AI applications.\n\nAlso Read: Meta launches Orion, its most advanced augmented reality glasses\n\nUsers can interact with Volkswagen's in-app assistant by posing questions such as \"How do I change a flat tire?\" or by using their phone cameras to scan vehicle dashboards for pertinent information.\n\nThe AI assistant leverages Google's Gemini large language models, which are designed to comprehend and generate predictive responses to human language, along with the capabilities of cloud computing.\n\nThe VW tool was developed by incorporating various resources, including Volkswagen owner's manuals and YouTube videos related to vehicle maintenance, into the Gemini platform.\n\nIn an interview with Reuters, Google Cloud CEO Thomas Kurian explained that the creation of this product involved addressing significant technical challenges associated with multimodality, which refers to the capability of processing diverse data formats such as text, images, and videos.\n\nKurian remarked, \"The issue may appear straightforward at first glance, but it is, in fact, highly intricate. Many individuals assume that what we have created is merely a speech-to-text translation system that retrieves information from a manual. This is not the case at all.\"\n\nThe AI assistant is provided at no cost and is accessible to approximately 120,000 owners of Volkswagen's Atlas and Atlas Cross Sport models. It is scheduled to be introduced to additional vehicles from the 2020 model year and beyond by early next year.\n\nThe integration of generative AI within corporations has the potential to transform the profitable cloud computing sector, in which Google currently ranks third in market share, following Amazon and Microsoft. Many organizations are still exploring viable applications that will resonate with users.\n\nAlso Read: Apple iPhone 15 prices drop in the UAE after iPhone 16 series launch; Details inside",
        "source": {
          "uri": "me.mashable.com",
          "dataType": "news",
          "title": "Mashable ME"
        },
        "authors": [
        ],
        "links": [
        ],
        "image": "https://sm.mashable.com/mashable_me/seo/default/google-mashable-2_36rk.jpg",
        "eventUri": "eng-9932784",
        "sentiment": 0.2392156862745098,
        "wgt": 465035181,
        "relevance": 1
      },
      {
        "uri": "8337749179",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:23:23",
        "dateTime": "2024-09-26T08:23:23Z",
        "dateTimePub": "2024-09-26T08:21:30Z",
        "dataType": "news",
        "sim": 0.572549045085907,
        "url": "https://www.yenisafak.com/en/news/turkiye-seeks-to-become-tech-development-hub-turkish-tech-minister-3691618",
        "title": "Türkiye seeks to become tech development hub: Turkish tech minister | News",
        "body": "'Türkiye can be one of world's important supply centers for renewable energy and chipmaking, with government funding appealing to global brands' says top official\n\nTürkiye aims to become a tech development hub and strengthen the position of the nation's tech initiatives worldwide, the nation's industry and technology minister told Anadolu at this week's UN General Embassy in New York.\n\nMehmet Kacir said the visits to New York and the US in general by him and President Recep Tayyip Erdogan have given them the chance to meet with heads of leading American firms, and this year, the Foreign Economic Relations Board (DEIK) held the Türkiye Investment Conference, attended by US-based business representatives.\n\nHe said he spoke to Nick Ammann, vice president of global government affairs at Apple, discussing Türkiye's potential contributions to the iPhone maker, urging Apple to invest in Türkiye's human resources.\n\n\"Türkiye's tech startups generate billions of dollars every year through their apps on the App Store, which we want to increase,\" Kacir added.\n\n\"The sectors this program focuses on are the ones that investors seek in order to diversify their investments, and as the pandemic made clear, when these sectors produce from a single production and supply point, the risk from this threatens the whole world, revealing the need for hubs spread out in multiple areas,\" he stressed.\n\n\"We believe Türkiye can be one of the world's important supply centers for renewable energy products and chips, and the government will provide global brands effective support through the program to register high gains in Türkiye's high-tech production and export figures,\" he added.",
        "source": {
          "uri": "yenisafak.com",
          "dataType": "news",
          "title": "Yeni Şafak"
        },
        "authors": [
          {
            "uri": "piri_medya_a_s@yenisafak.com",
            "name": "Piri Medya A.Ş.",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
        ],
        "image": "https://img.piri.net/piri/upload/3/2024/9/26/022f0cb5-oz2nrz7s4g5enwgtqh1wb.jpeg",
        "eventUri": "eng-9932240",
        "sentiment": 0.1607843137254903,
        "wgt": 465035003,
        "relevance": 1
      },
      {
        "uri": "8337746932",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:20:06",
        "dateTime": "2024-09-26T08:20:06Z",
        "dateTimePub": "2024-09-26T08:19:45Z",
        "dataType": "news",
        "sim": 0.4823529422283173,
        "url": "https://www.gearrice.com/article/study-iphone-16-is-the-least-popular-model-in-5-years/",
        "title": "Study: iPhone 16 is the least popular model in 5 years - GEARRICE",
        "body": "According to a recent study by investment bank Morgan Stanley, delivery times for the iPhone 16 are shorter than those of its predecessors, suggesting weaker demand for Apple's latest smartphone. A surprising trend as the Cupertino firm is betting big on artificial intelligence with its Apple Intelligence.\n\nMorgan Stanley analyzed the average times between pre-order and delivery of the different iPhone 16 models, and compared them to last year:\n\nOn average, the iPhone 16 delivery time has been just 9 days since pre-orders began, the shortest in 5 years, and roughly equivalent to that of the iPhone 12. According to Morgan Stanley, there is a more than 50% chance that Apple will reduce its orders from its suppliers.\n\nAnalysts note that early buyers seem to be primarily motivated by the renewal of an old phone, or by improved battery life and camera. Apple Intelligence, the big new feature of the iPhone 16, does not seem to weigh heavily in the purchasing decision for the moment. It must be said that it is currently only available in beta version.\n\nStill, it's still early to draw any definitive conclusions. Short lead times early in the cycle aren't always a reliable indicator. Apple may have anticipated demand better this year. And the full potential of Apple Intelligence remains to be demonstrated once the final version is available.\n\nStill, after signs of weakness in pre-orders and early employee discounts, these Morgan Stanley figures fuel doubts about the success of the iPhone 16. The mobile AI revolution promised by Apple may not yet be tangible enough to convince buyers to take the plunge. Stay tuned in the coming months.",
        "source": {
          "uri": "gearrice.com",
          "dataType": "news",
          "title": "GEARRICE"
        },
        "authors": [
          {
            "uri": "jasper_philipsen@gearrice.com",
            "name": "Jasper Philipsen",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://appleinsider.com/articles/24/09/25/shorter-lead-times-suggest-iphone-16-is-least-popular-since-the-iphone-12"
        ],
        "image": "https://i1.wp.com/iphonesoft.fr/images/2024/09/iphone-16-pro-max-iphone-16-plus.jpg?ssl=1",
        "eventUri": "eng-9928415",
        "sentiment": 0.2156862745098038,
        "wgt": 465034806,
        "relevance": 4
      },
      {
        "uri": "8337746933",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:19:58",
        "dateTime": "2024-09-26T08:19:58Z",
        "dateTimePub": "2024-09-26T08:19:45Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://www.gearrice.com/article/turn-all-the-lights-in-your-house-on-and-off-with-your-iphone-and-these-smart-switches-on-sale/",
        "title": "Turn all the lights in your house on and off with your iPhone and these smart switches on sale - GEARRICE",
        "body": "iPhones, as well as other Apple products, have an application called HomeKitwhich would be the brand's own and which helps us automate our homes through smart gadgets such as LED lights, switches, power strips and plugs, and a thousand other accessories that are compatible.\n\nToday we are going to see some switches very simple and pretty, compatible with this technology and on sale, allowing you to turn on or off the lights in any room of the house with your iPhone, and not only while you are there, but also remotely or by creating a routine.\n\nIf you are not familiar with the world of HomeKit, you will probably start trying it out today, and I assure you that once you do, you will not want to go back, and everything will seem very old-fashioned. And that is because Use Siri to turn on your bedroom lightsor creating a routine so that when we turn off the alarm clock the bedroom light turns on little by little, are things that are appreciated and that you get used to quickly.\n\nCurrently, on AliExpress, we can find one of the best smart switchesThere are many brands and models, but as a personal recommendation, today's is the most interesting. Also, on sale and with the possible coupons to apply, it is a ridiculous price, since in the end, buying traditional mechanical switches is not much cheaper.",
        "source": {
          "uri": "gearrice.com",
          "dataType": "news",
          "title": "GEARRICE"
        },
        "authors": [
          {
            "uri": "waniya_malik@gearrice.com",
            "name": "Waniya Malik",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
        ],
        "image": "https://i0.wp.com/lamanzanamordida.net/app/uploads-lamanzanamordida.net/2024/09/interruptor-apple-1.jpg?ssl=1",
        "eventUri": null,
        "sentiment": 0.4274509803921569,
        "wgt": 465034798,
        "relevance": 1
      },
      {
        "uri": "2024-09-496825451",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:19:50",
        "dateTime": "2024-09-26T08:19:50Z",
        "dateTimePub": "2024-09-26T07:22:06Z",
        "dataType": "news",
        "sim": 0.7450980544090271,
        "url": "https://www.gizbot.com/deal-of-the-day/flipkart-big-billion-days-2024-sale-massive-discounts-on-iphone-15-and-15-plus-102771.html",
        "title": "Flipkart Big Billion Days 2024 Sale: Massive Discounts on iPhone 15 and 15 Plus; Here's How Much Costs",
        "body": "The Flipkart Big Billion Days 2024 sale has officially kicked off for Plus and VIP members of the e-commerce platform and will be accessible for all users tomorrow, September 27. Flipkart is offering major discounts on a plethora of smartphones during the sale, particularly iPhones.\n\nThe iPhone 15 Plus is now selling for just Rs 61,749 (including a bank offer). On the other hand, the standard iPhone 15 is available for just Rs 54,999 instead of its original launch price of Rs 79,999. With an additional Rs 2750 discount, Flipkart Axis Credit card holders can get it for Rs 52,249. Now, it brings into question whether choosing the iPhone 15 instead of the latest iPhone 16 remains a wise decision.\n\niPhone 15 Vs iPhone 16: Which One Should You Buy?\n\nIf you are looking for an iPhone without breaking the bank, the iPhone 15 can still be a good choice, while you've to spend more than Rs 20,000 to get the latest iPhone 16. The standout feature of the iPhone 16 is the Apple Intelligence, which was limited to last year's iPhone 15 Pro models.\n\nFor people seeking iPhones for normal usage, the iPhone 15 can be worth considering for its asking price of Rs 52,249. It also runs iOS 18 and features the same 6.1-inch 60Hz screen with a Dynamic Island as the latest iPhone 16.\n\nHowever, one can get some benefits from spending more amounts on the iPhone 16 such as the new A18 chip, Apple Intelligence, a new camera capture button, and even the cameras on both models are almost similar except for the vertical camera arrangement with a pill-shaped protrusion.\n\nIf you are also looking for deals across other product categories like laptops, speakers, and TVs from Flipkart's Big Billion 2024 sale, here are some of the best offers you can now avail of -",
        "source": {
          "uri": "gizbot.com",
          "dataType": "news",
          "title": "Gizbot"
        },
        "authors": [
          {
            "uri": "tanaya_dutta@gizbot.com",
            "name": "Tanaya Dutta",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://www.gizbot.com/deal-of-the-day/flipkart-big-billion-days-2024-sale-iphones-pixels-samsung-best-deals-smartphones-102737.html",
          "https://www.gizbot.com/compare-mobiles/apple-iphone-15-vs-apple-iphone-16/",
          "https://www.gizbot.com/latest-mobiles/apple-iphone-16-10229/"
        ],
        "image": "https://images.gizbot.com/webp/img/2024/09/iphone153-1727334092.jpeg?26092024125929",
        "eventUri": "eng-9928415",
        "sentiment": 0.3098039215686275,
        "wgt": 465034790,
        "relevance": 5
      },
      {
        "uri": "2024-09-496824780",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:18:49",
        "dateTime": "2024-09-26T08:18:49Z",
        "dateTimePub": "2024-09-26T08:14:00Z",
        "dataType": "news",
        "sim": 0.4196078479290009,
        "url": "https://betanews.com/2024/09/26/save-39-95-get-winx-mediatrans-v8-0-ultimate-iphone-ipad-manager-for-pc-mac-for-free/",
        "title": "Save $39.95! Get 'WinX MediaTrans V8.0 -- Ultimate iPhone/iPad Manager for PC & Mac' for FREE",
        "body": "Struggling to free up enough space for the latest iOS upgrade or worried about losing data when switching to a new iPhone?\n\nGet a licensed copy of WinX MediaTrans V8.0 for free (regularly priced at $39.95) and seamlessly transfer data between your iPhone, iPad, and computer with no risk of data loss or leakage. WinX MediaTrans makes it easy to back up your iPhone data, freeing up storage space for upgrades, switching devices, or simply for daily file management. It's fast, secure, and user-friendly!\n\nKey Features:\n\nSay goodbye to storage problems, data loss, slow syncing, and the restrictions of iTunes. WinX MediaTrans gives you full control over your iPhone's data, making management a breeze!\n\nSEE ALSO: Apple launches iPhone 16 with advanced A18 chip, enhanced camera features and Apple Intelligence\n\nWinX MediaTrans V8, from Digiarty WinXDVD, usually retails for $39.95 but BetaNews readers can get it entirely free for a limited time.",
        "source": {
          "uri": "betanews.com",
          "dataType": "news",
          "title": "BetaNews"
        },
        "authors": [
          {
            "uri": "wayne_williams@betanews.com",
            "name": "Wayne Williams",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://betanews.com/2024/09/09/apple-launches-iphone-16-with-advanced-a18-chip-enhanced-camera-features-and-apple-intelligence/"
        ],
        "image": "https://betanews.com/wp-content/uploads/2024/09/WinX-MediaTrans.jpg?w=640",
        "eventUri": "eng-9928415",
        "sentiment": 0.1058823529411765,
        "wgt": 465034729,
        "relevance": 3
      },
      {
        "uri": "8337741088",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:16:03",
        "dateTime": "2024-09-26T08:16:03Z",
        "dateTimePub": "2024-09-26T08:15:33Z",
        "dataType": "news",
        "sim": 0.5921568870544434,
        "url": "https://www.indiatoday.in/technology/news/story/beats-launches-its-first-ever-case-for-iphone-16-phones-comes-with-touch-button-to-support-camera-control-2606782-2024-09-26",
        "title": "Beats launches its first-ever case for iPhone 16 phones, comes with touch button to support Camera Control",
        "body": "Beats launches cases for iPhone 16 seriesCases support Camera Control feature with touch buttonAvailable in vibrant colours, priced at Rs 4,900\n\nBeats has launched its first ever cases for the iPhone 16 phones. And to answer the common query regarding iPhone 16 series cases: whether third-party cases will sport a cutout for the Camera Control feature -- the Beats cases come with a touch button to support the feature. Which means you can use the Camera Control feature the same way you would use it on the iPhone 16s without the case; the case is smart enough to understand touch and pressure. Beats says that the touch button uses a sapphire crystal, which is connected to a conductive layer that communicates finger gestures to the Camera Control system. The new Beats cases also support MagSafe charging, just like the official Apple cases.\n\n\"We're delighted to introduce the first iPhone case designed by Beats,\" said Oliver Schusser, Apple's vice president of Apple Music and Beats. \"Beats has always been synonymous with distinctive style and vibrant colours and our new cases are the perfect way to accessorise the new iPhone 16 lineup.\"\n\nAdditionally, similar to the official Apple covers, the Beats cases are also lined with soft microfiber material. The cases are available in some beautiful and pop colours like Midnight Black, Summit Stone, Riptide Blue and Sunset Purple. The cases are available on the Apple India website and are priced at Rs 4,900. The pricing for the cases remains the same across all models -- iPhone 16, iPhone 16 Plus, iPhone 16 Pro, and iPhone 16 Pro Max. The cases are available to order via the Apple website and roughly have a delivery time of a week.\n\nThe new Beats cases are priced the same as the Apple silicone cases, which are also available for Rs 4,900 on the Apple website. The iPhone clear cases are also priced the same. But then, what's the difference? The Beats cases are more vibrant, and if we may say \"funky\". They sport a hard shell polycarbonate back, which is complemented by flexible sidewalls, which is meant to optimise shock absorption, while making the case thin, light and easy to grip.\n\nAdditionally, as mentioned above, the Beats cases are also MagSafe compatible, with built-in magnets to support wireless charging. Beats also says the packaging for the Beats iPhone 16 case is entirely fibre-based, with all wood fibres either fully recycled or responsibly sourced.",
        "source": {
          "uri": "indiatoday.in",
          "dataType": "news",
          "title": "India Today"
        },
        "authors": [
        ],
        "links": [
        ],
        "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202409/beats-case-for-iphone-16-series-launched-260604639-16x9_0.jpg?VersionId=cgFhP41h0eSYgHOZlPwUmo7vZGk3.Mvu",
        "eventUri": "eng-9930074",
        "sentiment": 0.3960784313725489,
        "wgt": 465034563,
        "relevance": 7
      },
      {
        "uri": "8337740594",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:15:24",
        "dateTime": "2024-09-26T08:15:24Z",
        "dateTimePub": "2024-09-26T08:15:13Z",
        "dataType": "news",
        "sim": 0.5568627715110779,
        "url": "https://www.fool.com/investing/2024/09/26/2-warren-buffett-stocks-to-hold-forever/",
        "title": "2 Warren Buffett Stocks to Hold Forever | The Motley Fool",
        "body": "These powerful brands will help grow your savings for a happy retirement.\n\nWarren Buffett's investing career has inspired countless investors to follow his strategy. There's no better way to start imitating the Oracle of Omaha than to follow his stock selections at Berkshire Hathaway.\n\nBerkshire owns dozens of privately owned businesses, but Buffett looks at buying stocks the same way as buying the whole business. Here are two stocks from Berkshire's portfolio to hold for a lifetime.\n\nCoca-Cola (KO 0.17%) has been a constant in Berkshire's stock portfolio for 35 years. The stock continues to be a strong performer, up 22% so far in 2024.\n\nDespite weak consumer spending trends this year, the beverage industry has remained resilient. Coca-Cola posted a 15% year-over-year increase in adjusted revenue in Q2, driven by balanced increases in pricing and concentrate sales.\n\nThe company has a powerful brand that gives the business a durable competitive advantage. Coca-Cola has valuable relationships with retail partners due to the brand's ability to drive sales. For example, the company recently launched a lighter and more affordable bottle in India that has extended shelf life, which is helping reach more customers and reduce costs.\n\nCoke is also leveraging the power of artificial intelligence (AI) to adjust pricing, which is driving revenue growth but also will lead to more efficient operations over time. The company's margins were up last quarter and that's a good sign of what's to come in a stronger demand environment.\n\nThe carbonated soft drink industry continues to show long-term growth potential. Statista estimates the revenue in the at-home market will grow 5% annually through 2028. Coca-Cola stock should grow in value over the long term, and investors also get the benefit of a forward dividend yield of 2.70% to pad returns.\n\nApple (AAPL -0.44%) stock has soared to new highs following the announcement of Apple Intelligence in June. Investors see a strong upgrade cycle coming for the iPhone, which generates most of Apple's $385 billion in annual sales.\n\nWhile Berkshire reduced its massive stake in Q2, Buffett isn't selling out of Apple. He previously called Apple a superior business to any Berkshire owns, and he mentioned at this year's shareholders' meeting that the stock will likely remain Berkshire's largest investment by the end of the year.\n\nWith an installed base of more than 2.2 billion active devices, Apple Intelligence is a free update coming to Apple's software but is expected to drive a major upgrade cycle for Apple over the next few years, since it will require devices with more recent processors. The AI features will undoubtedly reshape how millions of customers interact with their devices, and that could lead to another stretch of strong growth.\n\nUltimately, the most attractive opportunity for Apple is the impact a growing installed base of devices will do for its lucrative services business. Revenue from services is already hitting new records heading into the launch of Apple Intelligence next month, up 14% year-over-year last quarter. Apple has made investments to expand the content offering across Apple TV+ and other services, which has driven paid subscriptions to surpass 1 billion.\n\nApple stock is trading at a higher price-to-earnings ratio than when Buffett first bought shares in 2016, but investors should expect the stock to follow the growth in Apple's earnings. It's one of the most valuable brands in the world that should grow more valuable in the AI era.",
        "source": {
          "uri": "fool.com",
          "dataType": "news",
          "title": "The Motley Fool"
        },
        "authors": [
          {
            "uri": "john_ballard@fool.com",
            "name": "John Ballard",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://www.fool.com/investing/how-to-invest/famous-investors/warren-buffett-investments/",
          "https://www.fool.com/investing/how-to-invest/famous-investors/warren-buffett-investments/stocks-owned/",
          "https://www.fool.com/terms/a/artificial-intelligence/",
          "https://www.fool.com/investing/how-to-invest/stocks/how-to-invest-in-coca-cola-stock/",
          "https://www.fool.com/terms/f/forward-dividend-yield/",
          "https://www.fool.com/investing/how-to-invest/stocks/how-to-invest-in-apple-stock/"
        ],
        "image": "https://g.foolcdn.com/editorial/images/791598/warren-buffett.jpg",
        "eventUri": "eng-9932401",
        "sentiment": 0.2549019607843137,
        "wgt": 465034524,
        "relevance": 5
      },
      {
        "uri": "8337739244",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:14:57",
        "dateTime": "2024-09-26T08:14:57Z",
        "dateTimePub": "2024-09-26T08:14:04Z",
        "dataType": "news",
        "sim": 0.7960784435272217,
        "url": "https://www.moneycontrol.com/technology/apple-iphone-16-vs-iphone-14-should-you-be-looking-to-upgrade-article-12829957.html",
        "title": "Apple iPhone 16 vs iPhone 14: Should you be looking to upgrade?",
        "body": "Apple iPhone 16 series is finally available now, with Apple intelligence and some key hardware upgrades. The iPhone 16 is positioned as an excellent entry point from the series, especially for those wanting to experience iOS for the first time. However, for budget-conscious buyers, the iPhone 14 remains a solid option, especially as it is now available at a discounted price in India during the festive sale period.\n\nHere we now compare these two Apple smartphones and see which one is better.\n\nApple iPhone 16 vs iPhone 14: Display\n\nLike last year's iPhone 15, the iPhone 16 comes with a Dynamic Island notch instead of the static notch found on the iPhone 14. Both smartphones come with 60Hz OLED displays and a 6.1-inch screen size. With Dynamic Island, you get a more interactive display experience, with notifications, music controls, and other information seamlessly integrated into the pill-shaped notch.\n\nThe iPhone 16 also supports 2000 nits of peak brightness, compared to lower 2,000 nits peak brightness on the iPhone 14.\n\nApple iPhone 16 vs iPhone 14: Performance\n\nUnder the hood, the Apple iPhone 16 is powered by Apple's latest A18 Bionic chipset. It is a substantial upgrade from the A15 Bionic SoC in the iPhone 14. The A18 not only delivers faster performance and improved efficiency but also comes with Apple Intelligence (AI) support.\n\nWhile the A15 processor in the iPhone 14 remains powerful enough to handle most everyday tasks smoothly, the A18 offers better thermal efficiency and longevity. We also get higher 8GB RAM support on the iPhone 16 compared to 6GB RAM on the iPhone 15.\n\nApple iPhone 16 vs iPhone 14: Camera\n\nIf we talk about the cameras of both smartphones, the iPhone 16 comes with a 48MP main camera along and a 12MP ultrawide camera. On the other hand, the iPhone 14 has dual 12MP main and ultra-wide cameras. The iPhone 16 captures more detail, particularly in low-light settings, and has improved night and portrait mode support.\n\nAdditionally, the iPhone 16 comes with a new Camera Control button that allows quick access to photo features like zooming, adjusting focus, or changing camera modes.\n\nApple iPhone 16 vs iPhone 14: Battery\n\nThe Apple iPhone 16 comes with a bigger 3,561 mAh battery compared to the 3,279 mAh battery on the iPhone 14. The iPhone 16 also comes with faster charging speeds, as it supports up to 40W wired charging and 20W via a compatible MagSafe wireless charging adaptor.\n\nIn contrast, the iPhone 14 supports 20W wired and 15W wireless charging. Apple also claims that the iPhone 16 offers 22 hours of video playback, while the iPhone 14, offers 20 hours.\n\nApple iPhone 16 vs iPhone 14: Price\n\nIn India, the iPhone 14's base 128GB storage variant is currently priced at Rs 57,999, with further discounts available through bank offers or cashbacks. Meanwhile, the iPhone 16 has a starting price of Rs 79,900.",
        "source": {
          "uri": "moneycontrol.com",
          "dataType": "news",
          "title": "MoneyControl"
        },
        "authors": [
        ],
        "links": [
        ],
        "image": "https://images.moneycontrol.com/static-mcnews/2024/09/20240926063750_iPhone-16-vs-iPhone-14.jpg",
        "eventUri": "eng-9928415",
        "sentiment": 0.3960784313725489,
        "wgt": 465034497,
        "relevance": 16
      },
      {
        "uri": "2024-09-496817095",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:13:43",
        "dateTime": "2024-09-26T08:13:43Z",
        "dateTimePub": "2024-09-26T07:36:16Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://propakistani.pk/2024/09/26/infinix-secretly-developing-underwater-charging/",
        "title": "Infinix Secretly Developing Underwater Charging",
        "body": "Just a few weeks ago, Infinix captured the tech world's attention by reportedly developing the slimmest smartphone in the world. Leaked images comparing this device side-by-side with Apple's iPhone highlighted a remarkable difference in thickness, with rumors suggesting a profile of less than 6mm. This new device could set a ground-breaking standard for ultra-thin smartphones if accurate.\n\nBut Infinix isn't stopping at aesthetics. This upcoming phone is rumored to boast a large battery, a cutting-edge chipset, a tri-camera setup, and an advanced cooling system -- all seamlessly integrated into that impressively slim design. It is achieving such thinness without compromising performance hinges on advancements in battery technology, particularly the development of slimmer batteries.\n\nWhile the prospect of an ultra-thin smartphone may seem far-fetched, reports indicate that Infinix is leveraging breakthrough solid-state battery technology. Unlike traditional lithium-ion batteries, solid-state batteries offer several advantages: they are safer, possess a higher energy density, and have a longer lifespan. This innovation could provide Infinix's new device with a significant competitive edge, enhancing both its form factor and overall performance.\n\nWhat's even more intriguing is the potential for this technology to enable underwater charging. In a landscape where water resistance is increasingly standard among flagship smartphones, Infinix is reportedly taking a bold step forward. Sources suggest that the company is developing a revolutionary device capable of charging underwater.\n\nA leaked video purportedly shows the Infinix smartphone charging beneath the surface, a feat made possible through a combination of IP68-rated waterproofing and innovative nano-coating technology. Coupled with the solid-state battery, this feature could redefine how we utilize smartphones in aquatic environments. If confirmed, Infinix would become the first brand to offer such a ground-breaking advancement.\n\nImagine the possibilities: capturing breathtaking marine life or stunning coral reefs without worrying about battery life. This innovation could open doors to new photography techniques and experiences that were previously thought impossible, allowing users to document their underwater adventures in real time.\n\nWhat truly sets Infinix apart is its relentless pursuit of innovation, particularly in battery technology. Since launching its first-generation NOTE series, the company has consistently redefined smartphone charging capabilities with concepts like \"All-Round FastCharge.\" They have been pioneers in introducing groundbreaking features, including the first Android smartphone to support magnetic charging, the first smartphone with an astonishing 260W wired charging, and the ability to charge in extreme temperatures as low as -40°C.\n\nWith this unwavering commitment to pushing boundaries, Infinix may soon unveil not only the world's thinnest smartphone but also a revolutionary battery capable of charging underwater. If these advancements come to fruition, they could redefine the smartphone landscape and set new industry standards.\n\nCould this be the future of mobile technology? Only time will tell, but the potential is undeniably thrilling. Stay tuned as we continue to follow Infinix's journey into this exciting new frontier!",
        "source": {
          "uri": "propakistani.pk",
          "dataType": "news",
          "title": "ProPakistani"
        },
        "authors": [
        ],
        "links": [
        ],
        "image": "https://propakistani.pk/wp-content/uploads/2024/09/Infinix-Underwater-1.jpg",
        "eventUri": null,
        "sentiment": 0.1450980392156862,
        "wgt": 465034423,
        "relevance": 1
      },
      {
        "uri": "8337731205",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:09:15",
        "dateTime": "2024-09-26T08:09:15Z",
        "dateTimePub": "2024-09-26T08:08:25Z",
        "dataType": "news",
        "sim": 0.5333333611488342,
        "url": "https://finance.yahoo.com/news/2-warren-buffett-stocks-hold-080200078.html",
        "title": "2 Warren Buffett Stocks to Hold Forever",
        "body": "Warren Buffett's investing career has inspired countless investors to follow his strategy. There's no better way to start imitating the Oracle of Omaha than to follow his stock selections at Berkshire Hathaway.\n\nBerkshire owns dozens of privately owned businesses, but Buffett looks at buying stocks the same way as buying the whole business. Here are two stocks from Berkshire's portfolio to hold for a lifetime.\n\nCoca-Cola (NYSE: KO) has been a constant in Berkshire's stock portfolio for 35 years. The stock continues to be a strong performer, up 22% so far in 2024.\n\nDespite weak consumer spending trends this year, the beverage industry has remained resilient. Coca-Cola posted a 15% year-over-year increase in adjusted revenue in Q2, driven by balanced increases in pricing and concentrate sales.\n\nThe company has a powerful brand that gives the business a durable competitive advantage. Coca-Cola has valuable relationships with retail partners due to the brand's ability to drive sales. For example, the company recently launched a lighter and more affordable bottle in India that has extended shelf life, which is helping reach more customers and reduce costs.\n\nCoke is also leveraging the power of artificial intelligence (AI) to adjust pricing, which is driving revenue growth but also will lead to more efficient operations over time. The company's margins were up last quarter and that's a good sign of what's to come in a stronger demand environment.\n\nThe carbonated soft drink industry continues to show long-term growth potential. Statista estimates the revenue in the at-home market will grow 5% annually through 2028. Coca-Cola stock should grow in value over the long term, and investors also get the benefit of a forward dividend yield of 2.70% to pad returns.\n\nApple (NASDAQ: AAPL) stock has soared to new highs following the announcement of Apple Intelligence in June. Investors see a strong upgrade cycle coming for the iPhone, which generates most of Apple's $385 billion in annual sales.\n\nWhile Berkshire reduced its massive stake in Q2, Buffett isn't selling out of Apple. He previously called Apple a superior business to any Berkshire owns, and he mentioned at this year's shareholders' meeting that the stock will likely remain Berkshire's largest investment by the end of the year.\n\nWith an installed base of more than 2.2 billion active devices, Apple Intelligence is a free update coming to Apple's software but is expected to drive a major upgrade cycle for Apple over the next few years, since it will require devices with more recent processors. The AI features will undoubtedly reshape how millions of customers interact with their devices, and that could lead to another stretch of strong growth.\n\nUltimately, the most attractive opportunity for Apple is the impact a growing installed base of devices will do for its lucrative services business. Revenue from services is already hitting new records heading into the launch of Apple Intelligence next month, up 14% year-over-year last quarter. Apple has made investments to expand the content offering across Apple TV+ and other services, which has driven paid subscriptions to surpass 1 billion.\n\nApple stock is trading at a higher price-to-earnings ratio than when Buffett first bought shares in 2016, but investors should expect the stock to follow the growth in Apple's earnings. It's one of the most valuable brands in the world that should grow more valuable in the AI era.\n\nBefore you buy stock in Coca-Cola, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Coca-Cola wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you'd have $740,704!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\n\nJohn Ballard has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy.\n\n2 Warren Buffett Stocks to Hold Forever was originally published by The Motley Fool",
        "source": {
          "uri": "finance.yahoo.com",
          "dataType": "news",
          "title": "Yahoo! Finance"
        },
        "authors": [
        ],
        "links": [
          "https://www.fool.com/investing/how-to-invest/famous-investors/warren-buffett-investments/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=60bef854-236b-488c-946f-74e1fcae0173",
          "https://www.fool.com/investing/how-to-invest/famous-investors/warren-buffett-investments/stocks-owned/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=60bef854-236b-488c-946f-74e1fcae0173",
          "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=06cb9a71-c536-47db-bc19-14be7c44dc75&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-foolcom-sa-bbn-dyn%3Faid%3D10993%26source%3Disaeditxt0010951%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_yahoo%26ftm_pit%3D16425&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=60bef854-236b-488c-946f-74e1fcae0173",
          "https://www.fool.com/legal/fool-disclosure-policy/",
          "https://www.fool.com/investing/2024/09/26/2-warren-buffett-stocks-to-hold-forever/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=60bef854-236b-488c-946f-74e1fcae0173"
        ],
        "image": "https://s.yimg.com/ny/api/res/1.2/LQyWTraJ.n3wcp44Ocxw3Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/motleyfool.com/443cfb8196fe834e0dc90c34a9f58783",
        "eventUri": "eng-9930638",
        "sentiment": 0.2392156862745098,
        "wgt": 465034155,
        "relevance": 5
      },
      {
        "uri": "8337731306",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:08:48",
        "dateTime": "2024-09-26T08:08:48Z",
        "dateTimePub": "2024-09-26T08:08:29Z",
        "dataType": "news",
        "sim": 0.6784313917160034,
        "url": "https://yourstory.com/2024/09/apple-trifold-iphone-rumors-patent",
        "title": "Is Apple's Trifold iPhone coming soon? Here's the scoop!",
        "body": "Is tech giant Apple going to launch their first-ever Trifold iPhone? Here is what the latest patent filing hints!\n\nIn the ever-evolving world of technology, Apple has consistently pushed boundaries, blending innovation with functionality. As rumours are getting heated about a potential trifold iPhone, recent patent filings have ignited curiosity among tech enthusiasts and Apple fans alike.\n\nWhile it's still early days and nothing is confirmed, the latest reports suggest that Apple might indeed be exploring this groundbreaking design. Here is all you need to know about the tech giant's first-ever foldable smartphone project!\n\nImagine a device that combines the functionality of a smartphone and a tablet, offering a flexible display that folds into 3 sections. A trifold iPhone could provide users with a larger screen area when unfolded, enhancing their experience for multitasking, and gaming.\n\nBut the idea of a trifold display isn't entirely new; several companies like Samsung, and Huawei, have experimented with foldable technology. However, Apple's entry into this space could raise the bar significantly, especially given its reputation for premium design and functionality.\n\nA recent patent update published by the United States Patent and Trademark Office (USPTO) indicates that Apple is actively researching and developing a hybrid device featuring a trifold display.\n\nAs captured by Patently Apple, the 2015 patent titled ('Electronic Devices With Display And Touch Sensor Structures') outlines a flexible panel that could bend in 3 places, creating a compact form factor that expands when needed. This design would make the device more portable and allow for different ways of using the interface.\n\nThe patent also mentions the addition of an outer display that would work together with the main inner display, along with a third display positioned between the two. Each screen would be able to detect touchpoints independently.\n\nFor instance, users could run multiple applications side by side, making it easier to switch between screens without closing apps. This would align well with Apple's ongoing efforts to enhance productivity through iOS updates.\n\nFiling a patent does not guarantee that the product will enter the market immediately. However, it does indicate the efforts of Apple to explore the foldable smartphone design, something they have refrained from entering so far.\n\nThe concept of a trifold iPhone is exciting, but there are challenges to address, such as ensuring screen durability and user acceptance of a potentially bulkier design. Apple will need to maintain its high standards and strike a balance between functionality and design.\n\nWhile the idea of a trifold iPhone is still speculative, the insights from recent patents and reports indicate that Apple is not overlooking the potential of foldable technology. Whether or not we see a trifold iPhone soon remains uncertain, but it certainly has sparked interest and excitement among tech enthusiasts. As we await further developments, one thing is clear: Apple continues to push the boundaries of what's possible, and a trifold iPhone could be the next big leap in smartphone evolution. Stay tuned, as the next chapter in mobile innovation could be just around the corner!",
        "source": {
          "uri": "yourstory.com",
          "dataType": "news",
          "title": "YourStory.com"
        },
        "authors": [
          {
            "uri": "aasma_khan@yourstory.com",
            "name": "Aasma Khan",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://www.patentlyapple.com/2024/09/apple-reveals-that-one-of-their-foldable-iphones-is-likely-to-provide-an-outer-display-beyond-its-main-internal-foldable-disp.html"
        ],
        "image": "https://images.yourstory.com/cs/2/07f6d7f0ed8e11ed819979969b4b51e2/hu2-1727254410673.png",
        "eventUri": "fra-1109610",
        "sentiment": 0.1294117647058823,
        "wgt": 465034128,
        "relevance": 6
      },
      {
        "uri": "8337724155",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:03:51",
        "dateTime": "2024-09-26T08:03:51Z",
        "dateTimePub": "2024-09-26T08:03:38Z",
        "dataType": "news",
        "sim": 0.6941176652908325,
        "url": "https://tech.hindustantimes.com/wearables/news/amazon-great-indian-festival-2024-oneplus-watch-2r-apple-watch-series-9-and-other-top-5-smartwatches-to-buy-71727336220336.html",
        "title": "Amazon Great Indian Festival 2024: OnePlus Watch 2R, Apple Watch Series 9, and other top 5 smartwatches to buy",
        "body": "Here's the list of the top 5 smartwatches at a huge discounted price during the Amazon Great Indian Festival 2024.\n\nAmazon Great Indian Festival 2024: Looking for a feature-filled smartwatch to keep your health and fitness in check? Then now is the perfect time to get one, as the biggest Amazon Festival sale has started. While, the sale is currently live for Amazon Prime members, however, on September 27, everyone can take advantage of huge deals and discounts on products across several categories and brands.\n\nTo find you with right smartwatch options, we have curated a list top 5 smartphones with advanced features and brands including Apple, OnePlus, Amazfit, and others. Know which smartwatch you should consider buying during the Amazon Great Indian Festival Sale.\n\nAlso read: Amazon Great Indian Festival 2024: Apple Watch SE, Noise Pro 5 and other smartwatches with early discounts\n\nAmazfit Active Edge: If you are adventurous and a fitness enthusiast, then this smartwatch could be the right choice for you. The Amazfit Active Edge comes with a rugged design to withstand the bumps and scrapes. The smartwatch is integrated with the Zepp which provides a personalised training experience with AI. The smartwatch offers up to 16 days of battery, making it a perfect travel buddy. Now, the smartwatch will be available at a sale price of Rs. 4799.\n\nSamsung Galaxy Watch 6: The Samsung Galaxy Watch 6 comes with several advanced features, making health and fitness tracking seamless. The smartwatch offers features such as contactless payments via Samsung Wallet, blood pressure and ECG monitoring, sleep tracking, customized HR zones, and more. During the Amazon sale, the Samsung Galaxy Watch 6 will be available for Rs.19399, including bank offers.\n\nAlso read: 4 best smartphone deals in Amazon Great Indian Festival, Flipkart Big Billion sales: iPhone 15 Pro, Pixel 8 and more\n\nOnePlus Watch 2R: This is the newly launched smartwatch that comes with several health and fitness tracking features. The OnePlus Watch 2R is powered by Snapdragon W5 along with BES2700 dual chipsets. It also provides 2GB RAM and 32GB storage space. It offers features such as sleep tracking, stress monitoring, heart rate monitoring, heart rate warning, and more. The OnePlus Watch 2R will be available at a discounted price of Rs.12999 on Amazon.\n\nApple Watch Series 9: The next smartwatch in the list is the Apple Watch Series 9, which will be available at a huge discount price during the Amazon Great Indian Festival. The smartwatch is powered by the S9 chip to provide users with advanced health, safety and activity features. Users can track blood oxygen, ECG levels, deep sleep, and much more right from their wrist.\n\nAlso read: MacBook Air M1 for ₹53,000 in Amazon Great Indian Festival 2024: 4 big reasons to buy it\n\nAmazfit Active: Another feature-filled smartwatch which buyers should consider is the Amazfit Active which comes with a 1.75-inch HD AMOLED display, AI-powered Zepp coach,24-hour health monitoring features, and much more. Additinally, the smartwatch will be available at a sale price of Rs.4799 during the Amazon Great Indian Festival.",
        "source": {
          "uri": "tech.hindustantimes.com",
          "dataType": "news",
          "title": "Hindustan Times Tech"
        },
        "authors": [
        ],
        "links": [
          "https://tech.hindustantimes.com/tags/apple",
          "https://tech.hindustantimes.com/wearables/news/amazon-great-indian-festival-2024-apple-watch-se-noise-pro-5-and-other-smartwatches-with-early-discounts-71727182275746.html",
          "https://tech.hindustantimes.com/mobile/news/4-best-smartphone-deals-in-amazon-and-flipkart-festive-sales-2024-71727175096550.html",
          "https://tech.hindustantimes.com/laptops-pc/news/macbook-air-m1-for-rs-53-000-in-amazon-great-indian-festival-2024-4-big-reasons-to-buy-it-71727156487636.html"
        ],
        "image": "https://images.hindustantimes.com/tech/img/2024/09/26/1600x900/PastedGraphic-3_1699615240315_1727336286917.png",
        "eventUri": "eng-9932943",
        "sentiment": 0.6392156862745098,
        "wgt": 465033831,
        "relevance": 2
      },
      {
        "uri": "8337723367",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "08:03:15",
        "dateTime": "2024-09-26T08:03:15Z",
        "dateTimePub": "2024-09-26T08:02:59Z",
        "dataType": "news",
        "sim": 0.8078431487083435,
        "url": "https://www.tomsguide.com/phones/iphones/iphone-16-wait-times-are-up-to-a-month-long-5-useful-things-you-can-do-in-the-meantime",
        "title": "iPhone 16 wait times are up to a month long  --  5 useful things you can do in the meantime",
        "body": "If you went to the Apple website today and decided to order yourself a shiny new iPhone 16, you could face up to a four-week wait depending on the model and color you pick. That's a gaping hole in your schedule you may have intended to use for showing off the Camera Control and Apple Intelligence public beta features to your friends that you're now going to have to fill.\n\nFortunately, I've got some suggestions for you that are much more practical than just refreshing your order status page. I know you're excited to try out your new iPhone, but taking the steps below will make moving in even smoother.\n\nIf you're still uncertain if the iPhone 16 is worth it for you, have a look at our iPhone 16, iPhone 16 Plus, iPhone 16 Pro and iPhone 16 Pro Max reviews for our takes on these new models, or our iPhone 16 upgrade guide to give you a broad look at the last few generations of iPhone and what differences an upgrade could make for you. But assuming you've already placed an order and are now just counting down the days until the Apple courier knocks on your door, here are my tips.\n\nYeah, this one may not exactly be fun, but it's a worthhile thing to do. The fewer images, downloads and apps you have on your current iPhone, the less time it'll take to transfer it all over to the iPhone 16. It's extra important if you're going for a lower storage capacity, as it's all too easy to fill up your storage with hi-res 48MP photos or games to use with the tuned-up A18 chip.\n\nAssuming your current iPhone's new enough, updating to the newest version of iOS is highly recommended. It's not usually a problem moving from an iPhone running an older OS to one with a newer one, but as we saw with the iPhone 15 transfer issues last year, transferring to and from the latest software version is the best thing to do.\n\nIf you're going to move your data over to your new iPhone via the cloud, you can use Apple's Prepare for New iPhone tool (found under Transfer or Reset iPhone in the General section of Settings) to upload everything early. This doesn't use up your iCloud storage so it won't clog up your photo or device back-ups. The catch is the backup only lasts for 21 days (though you can extend it by another 21 days once), so make sure.\n\nHave you thought about what's going to happen with your current iPhone once all your stuff is set up on the new one? Are you trading it in to get a discount on the iPhone 16? Is it going to be handed down to someone else? Perhaps you could keep it for use with a work number or as a WiFi-only media player? If it's well past its best, you could recycle it in whichever way is locally available to you. Whatever you decide, don't let it clog up a drawer.\n\nDepending on what your last phone was, chances are you'll need to upgrade at least part of your peripheral kit to work with the iPhone 16. One obvious example is a case. No other iPhone case will fit the iPhone 16 due to changes in size, camera block shape and its new button layout including the Camera Control and Action button, so you can't try to reuse an old case or make one for a different iPhone 16 model fit. Check out our best iPhone 16 case guide, best iPhone 16 Pro cases and best iPhone 16 Pro Max cases for our recommendations.\n\nFor charging, you will need at least 20W of power to get Apple's promised charging speeds (although the iPhone can draw more under certain circumstances) and a USB-C cable to connect the charger to the iPhone. Apple gives you a cable in the box, but you may want more if you like having additional charging points for your phone, especially if you were previously set up for a Lightning-ported iPhone. As for wireless charging, the iPhone 16 works with Apple's renewed MagSafe standard or the generic Qi2 standard. So look out for mentions of those when looking for charging pucks with a wireless charging speed of 25W.",
        "source": {
          "uri": "tomsguide.com",
          "dataType": "news",
          "title": "Tom's Guide"
        },
        "authors": [
          {
            "uri": "richard_priday@tomsguide.com",
            "name": "Richard Priday",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://www.tomsguide.com/phones/iphones/apple-iphone-16-review",
          "https://www.tomsguide.com/phones/iphones/iphone-16-camera-control-heres-everything-it-can-do",
          "https://www.tomsguide.com/ai/ios-181-public-beta-arrives-heres-the-apple-intelligence-features-you-can-try-now",
          "https://www.tomsguide.com/phones/iphones/apple-iphone-16-plus-review-not-as-big-as-the-max-not-as-pricey-either",
          "https://www.tomsguide.com/phones/iphones/apple-iphone-16-pro-review",
          "https://www.tomsguide.com/phones/iphones/apple-iphone-16-pro-max-review",
          "https://www.tomsguide.com/phones/iphones/iphone-16-upgrades-who-should-make-the-jump-to-the-new-iphone-and-who-should-skip",
          "https://www.tomsguide.com/phones/iphones/iphone-16-pro-benchmarks-heres-how-it-stacks-up-to-android-flagships",
          "https://www.tomsguide.com/news/iphone-15-setup-bug-confirmed-by-apple-heres-how-to-fix-the-problem",
          "https://www.tomsguide.com/how-to/how-to-transfer-data-from-iphone-to-iphone",
          "https://futureplc.com/terms-conditions/",
          "https://futureplc.com/privacy-policy/",
          "https://www.tomsguide.com/phones/iphones/best-iphone-16-cases",
          "https://www.tomsguide.com/phones/iphones/best-iphone-16-pro-cases",
          "https://www.tomsguide.com/phones/iphones/best-iphone-16-pro-max-cases",
          "https://www.tomsguide.com/phones/iphones/iphone-16-issues-all-the-biggest-problems-so-far",
          "https://www.tomsguide.com/phones/i-put-the-iphone-16-pro-max-vs-galaxy-s24-ultra-through-a-7-round-face-off-heres-the-winner",
          "https://www.tomsguide.com/phones/iphones/iphone-16-pro-vs-iphone-16-pro-max",
          "https://mint-mobile.58dp.net/c/221109/1943604/7915?prodsku=7064396&u=https%3A%2F%2Fwww.mintmobile.com%2Fdevices%2Fapple-iphone-16-pro-max%2F7064355%2F%3Fcolor%3Dnatural-titanium%26mem%3D256GB&intsrc=CATF_15695&subId1=tomsguide-us-7205830549909033914&sharedId=tomsguide-us",
          "https://www.dpbolvw.net/click-8900245-13664766?url=http%3A%2F%2Ftracking.searchmarketing.com%2Fclick.asp%3Faid%3D330002190000030747&cjsku=sku32813v2&sid=tomsguide-us-3084488895252016951"
        ],
        "image": "https://cdn.mos.cms.futurecdn.net/8r8qdNfUV3ron54nHAyR45-1200-80.jpg",
        "eventUri": "eng-9928415",
        "sentiment": 0.1137254901960785,
        "wgt": 465033795,
        "relevance": 12
      }
    ],
    "totalResults": 23956,
    "page": 3,
    "count": 20,
    "pages": 3
  }
}