{
  "articles": {
    "results": [
      {
        "uri": "8337953557",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "10:37:35",
        "dateTime": "2024-09-26T10:37:35Z",
        "dateTimePub": "2024-09-26T10:37:20Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://phandroid.com/2024/09/26/the-iphone-16-could-be-apples-biggest-flop-in-years/",
        "title": "The iPhone 16 could be Apple's biggest flop in years - Phandroid",
        "body": "The new iPhone 16 is here. It is Apple's latest iPhone and its most powerful smartphone to date, but it seems that it could also be the company's biggest flop in years. This is according to the lead times on the devices, which are considerably shorter compared to its predecessor.\n\nAccording to the data from Morgan Stanley, the base iPhone 16 has a lead time of 9 days versus the 14 days of the iPhone 15. The iPhone 16 Plus has a lead time of 7.9 days versus 13.9 days, the iPhone 16 Pro has a lead time of 18.5 days instead of 32.5 days, and the iPhone 16 Pro Max has a lead time of 25.5 days versus 43.5 days for the iPhone 15 Pro Max.\n\nIt is possible that over the years, Apple has managed to more accurately predict demand, or they might have expanded production capabilities. This is one possibility that could explain the drop in lead times. Alternatively, it could simply be the fact that the iPhone 16 isn't a particularly exciting upgrade.\n\nIt is a powerful handset with some interesting new features. However, features like AI aren't even shipping with the handset yet. Apple made such a huge deal about its Apple Intelligence features but the fact that we aren't seeing it yet makes it a hard sell. Only time will tell if later on sales might pick up, but for now, it doesn't seem promising.",
        "source": {
          "uri": "phandroid.com",
          "dataType": "news",
          "title": "Phandroid - Android News and Reviews"
        },
        "authors": [
          {
            "uri": "tyler_lee@phandroid.com",
            "name": "Tyler Lee",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://appleinsider.com/articles/24/09/25/shorter-lead-times-suggest-iphone-16-is-least-popular-since-the-iphone-12?utm_medium=rss"
        ],
        "image": "https://phandroid.com/wp-content/uploads/2024/09/iphone-16-pro-6.png",
        "eventUri": null,
        "sentiment": -0.0117647058823529,
        "wgt": 465043055,
        "relevance": 4
      },
      {
        "uri": "8337952323",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "10:36:36",
        "dateTime": "2024-09-26T10:36:36Z",
        "dateTimePub": "2024-09-26T10:36:22Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://www.latestly.com/technology/iphone-15-available-at-discounted-rate-in-flipkart-big-billion-days-2024-check-effective-price-after-discount-and-offers-specifications-and-more-6296811.html",
        "title": "iPhone 15 Available at Discounted Rate in Flipkart Big Billion Days 2024; Check Effective Price After Discount and Offers, Specifications and More | 📲 LatestLY",
        "body": "Mumbai, September 26: Flipkart Big Billion Days 2024 sale is now live for the Plus and VIP members across India offering massive discount on the iPhone 15 at as low as INR 49,999. The Flipkart Plus members and Flipkart VIP members are able to avail these benefits ahead of the official sales starting from September 27, 2024. However, recently Apple launched iPhone 16 series with better processor and promise of future AI features. So, here's everything to know about the last year's iPhone 15 model before making purchase.\n\niPhone 15 is available in 128GB, 256GB and 512GB variants and all priced differently on the official Apple.com and Flipkart website. The Apple iPhone 15 is available in blue, pink, yellow, green and black colour options. It is available with Apple's A16 bionic chipset and 48MP primary camera. The battery on the device is also offers claimed 9 hours of usage. It has a 6.1-inch display and comes with Dynamic Island notch.\n\niPhone is available at INR 69,900 on the official Apple website whereas it is listed at INR 63,999 on the Flipkart. During the Flipkart Big Billion Days 2024, currently live for Plus and VIP customers, the iPhone 15 is available at INR 54,999. The customers also get the chance to avail express delivery which transports the device within a day. Under an \"Unbeatable deal\", Flipkart is offering the iPhone 15 128GB variant at as lowest price as INR 52,249.\n\niPhone 15 is available to the Flipkart Plus and Flipkart VIP members with a flat INR 14,901 discount making the effective price of the device INR 40,098 or as low as INR 37,348. Additionally, the customers can avail the discount of INR 3,000 on exchanging the older phones and buying the new iPhone 15. HDFC Bank card holders can avail INR 2,000 benefits.\n\nThe iPhone 15 256GB is available at INR 64,999 and Flipkart is offering it on an \"Unbeatable deal\" at INR 61,749. On these device, Apple is offering 1 year of warranty and bonus of fast-shipment through express delivery.",
        "source": {
          "uri": "latestly.com",
          "dataType": "news",
          "title": "LatestLY"
        },
        "authors": [
          {
            "uri": "team_latestly@latestly.com",
            "name": "Team Latestly",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
        ],
        "image": "https://st1.latestly.com/wp-content/uploads/2024/09/95-61-784x441.jpg",
        "eventUri": null,
        "sentiment": 0.2313725490196079,
        "wgt": 465042996,
        "relevance": 5
      },
      {
        "uri": "8337949966",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "10:35:02",
        "dateTime": "2024-09-26T10:35:02Z",
        "dateTimePub": "2024-09-26T10:34:31Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://forums.macrumors.com/threads/a-look-back-iphone-4s-vs-iphone-16-pro-max.2438201/",
        "title": "A look back - iPhone 4S vs iPhone 16 Pro max :)",
        "body": "You are using an out of date browser. It may not display this or other websites correctly.\n\nYou should upgrade or use an alternative browser. Here's a little nostalgia for those who had the early iPhones.\n\nApple's smallest ever iPhone screen vs the largest ever iPhone screen\n\nUnfortunately I can't get the old 4S to connect to WiFi so the first setup page is all I can show.\n\nI'm actually surprised it turns on at all.\n\nIt's been sitting in a drawer for over 10yrs, and luckily I was smart enough at the time to leave a 30 pin cable next to it..!\n\nAnyhow, enjoy a quick look down memory lane and marvel at how far we have come!",
        "source": {
          "uri": "forums.macrumors.com",
          "dataType": "news",
          "title": "MacRumors Forums"
        },
        "authors": [
        ],
        "links": [
        ],
        "image": "https://forums.macrumors.com/attachments/img_1280-jpeg.2428383/",
        "eventUri": null,
        "sentiment": 0.1686274509803922,
        "wgt": 465042902,
        "relevance": 1
      },
      {
        "uri": "8337949961",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "10:34:43",
        "dateTime": "2024-09-26T10:34:43Z",
        "dateTimePub": "2024-09-26T10:34:31Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://www.macrumors.com/how-to/ios-motion-sickness-prevention/",
        "title": "Avoid Vehicle Motion Sickness With This New iOS 18 Feature",
        "body": "In iOS 18, Apple added several new accessibility features, and one feature in particular that is likely to have widespread appeal among car passengers is Vehicle Motion Cues, which aims to prevent motion sickness when looking at an iPhone or iPad.\n\nAccording to Apple, research shows that motion sickness is commonly caused by a sensory conflict between what a person sees and what they feel, which can prevent some users from comfortably using an iPhone or iPad while riding in a moving vehicle.\n\nVehicle Motion Cues are designed to avoid this sensory conflict with the use of visual elements on the display that indicate real-time changes in motion. Apple explains:\n\nWith Vehicle Motion Cues, animated dots on the edges of the screen represent changes in vehicle motion to help reduce sensory conflict without interfering with the main content. Using sensors built into iPhone and iPad, Vehicle Motion Cues recognizes when a user is in a moving vehicle and responds accordingly. The feature can be set to show automatically on iPhone, or can be turned on and off in Control Center.\n\nThe following steps show you how to enable Vehicle Motion Cues in iOS 18 and iPadOS 18:\n\nNote that choosing On shows the dots until you turn them off, while choosing Automatic shows the dots when vehicle motion is detected and hides them when the motion stops. If you turned on the feature, you should now see the motion cues - roving little dots around the edges of your iPhone or iPad screen. If you opted for the automatic activation, wait until you're in a moving vehicle for the cues to appear.\n\nAlternatively, you can add a Vehicle Motion Cues button to the Control Center. Here's how:\n\nThere's no guarantee that the feature will work for everyone, but with a bit of luck, it will allow you or your kids to look at what's on the screen for the duration of the journey without starting to feel nauseous.",
        "source": {
          "uri": "macrumors.com",
          "dataType": "news",
          "title": "MacRumors"
        },
        "authors": [
          {
            "uri": "tim_hardwick@macrumors.com",
            "name": "Tim Hardwick",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://www.macrumors.com/guide/accessibility/"
        ],
        "image": "https://images.macrumors.com/t/rzgznHv2OKfjUBB_vQFMEtrN7zY=/1920x/article-new/2024/07/avoid-travel-sickness-vehicle-motion-cues.jpg",
        "eventUri": null,
        "sentiment": -0.06666666666666665,
        "wgt": 465042883,
        "relevance": 3
      },
      {
        "uri": "8337937813",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "10:26:01",
        "dateTime": "2024-09-26T10:26:01Z",
        "dateTimePub": "2024-09-26T10:25:48Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://www.gadgets360.com/wearables/news/apple-vision-pro-cheaper-model-oled-display-resolution-6654376",
        "title": "Apple's Cheaper Vision Headset Could Have Lower Resolution OLED Displays",
        "body": "Apple could equip its cheaper headset with low resolution displays\n\nApple Vision Pro was launched earlier this year as the company's first mixed reality (MR) headset, with a $3,499 (roughly Rs. 2,92,900) price tag. While it is a premium device that is available in a handful of countries, the iPhone maker has been working on developing a cheaper Vision headset that could be unveiled in the coming years, according to previous reports. In order to cut costs while developing its next spatial computer, Apple is reportedly exploring the use of lower resolution OLED displays.\n\nThe Elec reports (in Korean) that Apple recently received an OLED panel sample from Japan Display Inc. (JDI) that is designed to be used in MR headsets. This panel is said to use a cheaper component instead of OLED-on-Silicon (OLEDoS) for the board, which means it could have a 1,500ppi resolution.\n\nThis is significantly lower than the resolution of the displays on the first-generation Apple Vision Pro -- 3,391ppi. Citing industry sources, the publication also says that the sample being reviewed by the iPhone maker also uses technology from Sony, Apple's primary supplier for the Vision Pro panels.\n\nIn July, it was reported that Apple was planning on equipping its next Vision headset with a 2.1-inch OLEDoS displays with a resolution of 1,700ppi. This suggests that the size of the displays on the more affordable MR headset will be larger than the first-generation Vision Pro, which has a much higher resolution.\n\nAt the time, Apple was said to have contacted two other suppliers -- LG and Samsung -- for information related to these microdisplays. It is currently unclear whether Apple has received a response to its request for information (RFI) from both firms.\n\nBloomberg's Mark Gurman previously claimed that Apple was still working on expanding its Vision mixed reality devices lineup, and that the company could launch two new devices. The cheaper of these will arrive in 2025, according to the journalist. However, if the information shared by The Elec is accurate, the cheaper MR headset might not be launched for another couple of years.",
        "source": {
          "uri": "gadgets360.com",
          "dataType": "news",
          "title": "NDTV Gadgets 360"
        },
        "authors": [
        ],
        "links": [
          "https://www.thelec.net/news/articleView.html?idxno=4967",
          "https://www.gadgets360.com/wearables/news/meta-orion-ar-glasses-prototype-6652828",
          "https://www.gadgets360.com/wearables/news/apple-cheaper-vision-pro-headset-lower-resolution-display-report-6008827",
          "https://www.gadgets360.com/wearables/news/meta-quest-3s-price-launch-sale-date-specifications-features-6652539",
          "https://www.gadgets360.com/wearables/news/meta-cancels-plans-for-high-end-mixed-reality-headset-report-6406449",
          "https://www.gadgets360.com/wearables/news/ray-ban-meta-glasses-update-ai-new-features-connect-2024-6653973",
          "https://www.gadgets360.com/wearables/news/htc-vive-focus-vision-price-launch-sale-date-specifications-features-6599907",
          "https://www.gadgets360.com/wearables/news/vision-pro-vision-correction-lenses-zeiss-inserts-patent-apple-6401017",
          "https://www.gadgets360.com/wearables/news/apple-smart-glasses-cheaper-vision-pro-product-roadmap-report-6320622"
        ],
        "image": "https://i.gadgets360cdn.com/large/apple_vision_pro_apple_1721394260701.jpg",
        "eventUri": null,
        "sentiment": 0.05098039215686279,
        "wgt": 465042361,
        "relevance": 4
      },
      {
        "uri": "8337926848",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "10:19:37",
        "dateTime": "2024-09-26T10:19:37Z",
        "dateTimePub": "2024-09-26T10:19:18Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://9to5toys.com/2024/09/26/airpods-4-best-price-ever-deal/",
        "title": "New AirPods 4 just hit the best prices ever from $109, Active Noise Cancellation set now down at $159",
        "body": "While we are still tracking Amazon lows on AirPods 4, Woot is stepping in today to deliver the best prices yet with full Apple warranties. You can now score AirPods 4 for $109 and AirPods 4 with Active Noise Cancellation at $159, both with free shipping for Prime members (a $6 delivery fee will apply otherwise). Regularly $129 and $179, you're looking at the lowest prices we have tracked to date on the brand new Apple buds. Amazon is currently offering these two sets at $119 and $169, respectively. And for further comparison, Best Buy is still asking for the full MSRP with slight $9 price drops for its paid Plus and Total members.\n\nThese Woot deals come by way of the online retailer's latest Best of Tech sale, and are surprising to say the least. We certainly see some great deals on the Amazon-owned bargain site on a regular basis, but to see it land with lower prices tags than Amazon itself on brand new Apple tech is quite rare. They are brand new units with full Apple warranties in tow as well.\n\nThe new AirPods 4 landed earlier this month alongside the new iPhone 16 handsets, Apple Watch Series 10, and the new black titanium Apple Watch Ultra 2.\n\nThey feature a redesigned form-factor geared towards \"all-day comfort\" with a \"refined contour, shorter stem, and quick-press controls for music or calls.\" As detailed in our hands-on review, they come powered by Apple's H2 chip to support the the new Siri hands- and voice-free interactions Apple announced for AirPods Pro 2 earlier this year alongside Personalized Spatial Audio with dynamic head tracking and Voice Isolation - \"reduces background noise while isolating and clarifying the sound of your voice for whomever you're speaking to.\" The set without noise cancelling is rated for 5 hours of battery life in the buds with a total of 30 hours of wireless playback when you factor in the include charging case.\n\nAirPods 4 have been redesigned for exceptional all-day comfort and greater stability. With a refined contour, shorter stem, and quick-press controls for music or calls. Personalized Spatial Audio with dynamic head tracking places sound all around you, creating a theater-like listening experience for music, TV shows, movies, games, and more. AirPods 4 feature the Apple-designed H2 chip. Voice Isolation improves the quality of phone calls in loud conditions. Using advanced computational audio, it reduces background noise while isolating and clarifying the sound of your voice for whomever you're speaking to.",
        "source": {
          "uri": "9to5toys.com",
          "dataType": "news",
          "title": "9to5Toys"
        },
        "authors": [
          {
            "uri": "justin_kahn@9to5toys.com",
            "name": "Justin Kahn",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://9to5toys.com/2024/09/23/first-deal-airpods-4-anc/",
          "https://howl.link/degx3hqu06037",
          "https://howl.link/41hvca4sggkto",
          "https://howl.me/cnaOmGFP54Z",
          "https://howl.link/sq7xttomwkkfd",
          "https://redirect.viglink.com/?key=0ab71bd42c2ca312a536dac167978a13&u=https%3A%2F%2F9to5mac.com%2F2024%2F09%2F23%2Fairpods-4-hands-on-review%2F&type=ap&loc=https%3A%2F%2F9to5toys.com%2F2024%2F09%2F23%2Ffirst-deal-airpods-4-anc%2F&ref=https%3A%2F%2F9to5toys.com%2F%3Fs%3DAirPods%2B4",
          "https://9to5mac.com/2024/09/25/how-to-use-new-airpods-features/",
          "https://9to5mac.com/2024/09/09/airpods-4-vs-airpods-pro-compared-differences/",
          "https://9to5mac.com/airpods-4-vs-airpods-pro-compared/",
          "https://9to5mac.com/about/#affiliate",
          "https://www.youtube.com/9to5toys?sub_confirmation=1"
        ],
        "image": "https://i0.wp.com/9to5toys.com/wp-content/uploads/sites/5/2024/09/AirPods-4-trade-in-deals.jpg?resize=1200%2C628&ssl=1",
        "eventUri": null,
        "sentiment": 0.4039215686274509,
        "wgt": 465041977,
        "relevance": 4
      },
      {
        "uri": "8337924535",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "10:17:54",
        "dateTime": "2024-09-26T10:17:54Z",
        "dateTimePub": "2024-09-26T10:17:38Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://www.gearrice.com/article/change-discovered-in-iphone-16-batteries-replacing-them-will-be-much-easier/",
        "title": "Change discovered in iPhone 16 batteries: replacing them will be much easier - GEARRICE",
        "body": "It is quite curious, and a change that could come close to what the EU is asking for by 2027, which is that batteries must be able to be replaced by users, or at least in a much simpler way.\n\nWe leave the video here, in case you want to take a look. At minute 4:00 you can see how by applying power to the battery, it ends up detaching itself from the device without any problem and without leaving any marks, something that also makes it easier for Apple not to find out that we have manipulated it, since it will go back to its position, without having to use, as we have already said, a glue that, if you have ever tried it, you will realize that it is never the same as the first one, and it is quite dirty to change it, as well as complicated, sometimes, depending on how hard it has acted.\n\nAs for the rest of the device, there don't seem to be any notable changes, although this would be one that Apple obviously didn't mention in its presentation, but that you have to take into account, especially if you're dedicated to it, since the way to replace the battery will have changedand you will have to take this into account. In my case, and I'm sure in the case of many of you reading this, it doesn't matter, since, at least I, don't dare to change it, for fear of losing the warranty and because it wouldn't be original, so I prefer to take it to a SAT or Apple Store, where they will also have received training on it.\n\nAre you one of those who takes their iPhone in for repairs, or do you do it yourself? If so, do you think this change will make everything easier, or, on the contrary, would you rather just remove the battery and use another glue, or even not use anything at all, since the previous glue, in many cases, was enough for the new one?, despite the fact that aesthetically there were marks and residue everywhere. Leave us a comment with your opinion.",
        "source": {
          "uri": "gearrice.com",
          "dataType": "news",
          "title": "GEARRICE"
        },
        "authors": [
          {
            "uri": "waniya_malik@gearrice.com",
            "name": "Waniya Malik",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
        ],
        "image": "https://i3.wp.com/lamanzanamordida.net/app/uploads-lamanzanamordida.net/2021/11/Fundas-iPhone-13-Pro-1.jpg?ssl=1",
        "eventUri": null,
        "sentiment": 0.06666666666666665,
        "wgt": 465041874,
        "relevance": 2
      },
      {
        "uri": "8337913752",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "10:11:06",
        "dateTime": "2024-09-26T10:11:06Z",
        "dateTimePub": "2024-09-26T10:10:51Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://www.businessinsider.nl/millennials-and-gen-zers-are-now-helicopter-parenting-their-parents/",
        "title": "Millennials and Gen Zers are now helicopter parenting their parents",
        "body": "Sherry Howard was eating at an Italian restaurant in Ohio last year when her 28-year-old daughter called asking for some food from the restaurant. Howard was stunned -- not at the request but at the fact that her daughter knew where she was.\n\nIt turned out she was being tracked -- and had been for two years. Ever since Howard went on a solo trip to the Caribbean and her children activated Find My People on her phone, without her knowledge, they had been able to keep tabs on her location.\n\n\"It was laughable, but I was shocked,\" Howard, 53, told me. \"To be honest, I didn't know how I felt about it.\"\n\nIt's a reversal from when Howard's children were young -- before the age of smartphones -- and she was the one keeping close tabs on them. \"If 15 minutes went by and they weren't at home, then that's when the panic mode set in,\" she said. \"Then I'm peeking out the window looking for them or I'm calling their friends.\"\n\nShe added: \"They knew, 'Mom's going to freak out if I come home a little late.'\" Her kids were rarely late.\n\nStill, she was taken aback by being tracked unknowingly, so she took to TikTok to jokingly express her grievances. \"This message is for all the grown kids out there,\" she said in the video. \"Stop stalking your parents!\" Her post racked up millions of views -- and comments claiming to be from adult children who keep tabs on their parents' whereabouts poured in.\n\nWhile parents have used location-tracking apps to keep an eye on their kids since the tech was invented, millennials and Gen Zers are now turning the all-seeing eye onto their parents. Among some families, tracking one another with apps like Apple's Find My and Life360 has become the norm. They see it as a fun way to stay connected and keep aging relatives safe. But when relationships turn awry or people start tracking others in secret, location sharing can easily turn into an invasion of privacy that family members come to resent.\n\nThese days, monitoring goes both ways. The kids who grew up with extra watchful parents are now carefully eyeing their parents' every move. The trackers have become the tracked.\n\nMost of the people I spoke with felt that tracking their family members afforded some relief about their safety. A 2022 poll by The Harris Poll and The New York Times found that one in six respondents reported always having location sharing turned on, and 37% of those who said they used location-sharing apps (like Find My) said doing so made them feel safer. Just last year, Life360, one of the most prominent tracking apps, reported 50 million monthly active users, with downloads in the US doubling since 2021 as it gained popularity among Gen Zers. And increasingly, safety concerns are extending up a generation -- kids are now concerned about their parents rather than just the other way around.\n\nGrowing up in West Virginia, Kacy Shafer had \"pretty protective\" parents, she said. She was an only child and her dad served in the military, so it was mostly her mother who laid down the rules.\n\n\"I wasn't allowed to just go have playdates wherever I wanted -- she had to call the parents, make sure they would be there,\" Shafer, who is 29, said. While phones lacked tracking technology when Shafer was younger, her parents set hard limits on which hours she could use her first cellphone and whom she could contact.\n\nThe roles are kind of reversed now in a way that I am kind of the parent.\n\nNow as an adult, Shafer tracks her mom's phone. \"It's kind of funny how the tables have turned,\" she said. As her 61-year-old mom has gotten older, checking where she is at least once a day offers some \"peace of mind,\" Shafer says. Her mother doesn't mind the tracking. In fact, they check in on each other and joke about it a lot. \"Sometimes, I just check to see where she's at, and I'm like: 'Hey, are you at the store? Can you grab me this?'\" Shafer said.\n\nStephiney Foley, 37, also had strict parents. Her family immigrated to New York from Shanghai when she was 8. She described her mom and dad's parenting style as \"very typical of overbearing parents, especially immigrant parents.\" Tracking technology wasn't around when Foley was a teen, but her parents still kept a close eye. \"My mom is constantly on my back looking over my shoulders doing things, even when I was in high school,\" Foley told me.\n\nLike Shafer, Foley now tracks her parents, who are in their 60s and 70s. It's typically a safety precaution when they travel. One time her mother got lost driving her RV in the Great Smoky Mountains in Tennessee and Foley was able to help her navigate out of the park.\n\n\"The roles are kind of reversed now in a way that I am kind of the parent,\" she said. Tracking allows Foley, who lives in Seattle, to feel more connected to her Florida-based parents and feel empowered to help in emergencies.\n\nKelley Roebuck, a 46-year-old living in Illinois, installed a tracking app on her son's phone when he was in junior high school to know his whereabouts after he lost his phone twice. At first, it was just a way to keep track of his phone, but it's since morphed into a more central part of their lives. Her son, now 20, tracks her back.\n\n\"One day, I didn't come straight home and he called me, 'Mom, what are you doing at Cousin Erica's house?'\" Roebuck told me. She described her son, who is also her only child, as \"very protective of his friends and family.\" When she used to go out of town often, he would check in when he didn't see her at the hotel or her friend's house.\n\nRoebuck and her son now track each other \"evenly.\" When he is out late, she wants to make sure he's in a safe place. Even her son's best friend, whom Roebuck considers her \"bonus son,\" wanted to share locations with her, so he was added to their Life360 plan in high school.\n\nYears later, her son's friend called Roebuck when she was out late to check in on her. When she asked how he knew where she was, he reminded her he had the tracker.\n\n\"I was like, 'Oh, I forget y'all still had it,\" Roebuck said.\n\nNot all adult children had neutral views on being tracked by their parents when they were younger. Gabrielle Lask, a 25-year-old only child, has been tracked by her mother since she got an iPhone at age 13. Though she said her mom was acting out of love and concern, she also described being tracked as \"incredibly annoying and, at times, a total invasion of privacy.\"\n\n\"I was a very good kid, very trustworthy,\" Lask told me. \"She just has really bad anxiety.\"\n\nLask described her mom as very overprotective; she would often text her about her whereabouts and what she was doing even though she was also tracking her location.\n\nNow that she is older and living independently, Lask has started to push back. \"You're not using this as a safety mechanism anymore,\" she recalled telling her mom a few years ago when she was really upset. \"You're using it as an invasion of privacy.\" Lask temporarily blocked her mom from seeing her location, which she said made her mom \"freak out.\"\n\n\"I basically said, 'I will put you back, but this cannot continue,'\" Lask said. \"'You have to use it as what it's meant to be used for.'\"\n\nThe excessive concern didn't get passed down to Lask. She doesn't track her mom's location -- and she doesn't have much interest in knowing it. \"She doesn't go out much, and if she does, trust and believe, she is texting and calling me nonstop,\" she said. \"I don't worry about her because she worries about me.\"\n\nDr. Kanchi Wijesekera, a clinical psychologist in California, said helicopter parenting through methods like intensive tracking makes kids feel \"suffocating and that parents do not trust them.\" She said it could ultimately add strain to the relationship as kids grow older and start setting boundaries. If kids -- and parents -- don't feel listened to, it can drive a wedge between them.\n\nIf they have a really close bond, it's easier to see those behaviors from a well-intentioned place.\n\nSometimes, though, those conversations can be transformative in a positive way. When Julianne Goldfinger was 15, her mom ordered paper copies of her texts from their cell provider. Her mom had been worried about how little she knew about Goldfinger's life now that she silently texted her friends -- but it still felt like an invasion of privacy.\n\n\"I was old enough when she did that to kind of push back at her and say, 'You really broke my trust here,'\" Goldfinger, now 35, told me. \"That was a turning point -- my mom realizing that I was growing up and needed some space.\"\n\nGoldfinger and her parents now track each other's locations when they respectively travel, which doesn't bother her since she's been able to have open conversations with her mom.\n\n\"I've really come to find my mom to be more of my friend,\" Goldfinger said.\n\nIncreasingly, parents and their adult kids are staying in closer contact than generations past. One Pew Research study published in January found that over 70% of respondents with children ages 18 to 34 reported speaking with their kids at least a few times a week on the phone. And more parents are tracking their kids in college to help quell their anxiety about the separation.\n\nIt's a big shift from the weekly or monthly check-in phone calls that ruled parent-child relationships in the past. But many families like the extra interaction. For more people, location sharing is simply a way to stay connected.\n\nAfter Howard got over the initial shock of being tracked without her consent, she started to understand the appeal of the tech and began following her children's locations, too.\n\n\"My one daughter, she went out of town just a couple of weeks ago, and I'm watching her come down I-75, and I'm thinking in my mind, 'She's driving awfully fast,'\" Howard said. She added that the mutual tracking gives her peace of mind that her kids aren't in danger.\n\nWijesekera said that attitudes around tracking are shaped by trust and communication. \"If they have a really close bond, it's easier to see those behaviors from a well-intentioned place versus a sign of their lack of trust and wanting to hover and force their decisions on us.\" Kids who grew up being accountable for their whereabouts don't necessarily look back on the memory negatively, so long as they feel their parents trusted them.\n\nThat's certainly true for Joy Loverde. The 72-year-old shares and tracks locations with both her 49-year-old daughter and her two adult grandchildren. \"We jumped on it early on,\" Loverde, who lives in Illinois, told me. \"It was just a matter of wanting to remain even closer.\"\n\nLoverde raised her only daughter on her own, and they've stayed very close -- now Loverde, her daughter, and her daughter's daughter all track one another. They do it partly to check in, and partly just to know more about one another's lives. \"We laugh -- we think it's really funny,\" Loverde said. \"We're poking in and out all the time.\"\n\nFor families like theirs, it's simply a new kind of love language.\n\nJulia Pugachevsky is a senior health reporter at Business Insider.\n\nRead the original article on Business Insider",
        "source": {
          "uri": "businessinsider.nl",
          "dataType": "news",
          "title": "Business Insider Nederland"
        },
        "authors": [
          {
            "uri": "julia_pugachevsky@businessinsider.nl",
            "name": "Julia Pugachevsky",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://www.tiktok.com/@ilove2giggle2/video/7274580138480651562",
          "https://www.tiktok.com/@the_jcrobinson/video/7274772471444753706",
          "https://www.businessinsider.com/teens-tracking-app-locations-not-stalking-good-parenting-2024-2",
          "https://www.businessinsider.com/dont-track-teen-phone-freedom-parent-worry-2024-3",
          "https://www.businessinsider.com/track-kids-locations-smartphone-pros-cons-2024-2",
          "https://theharrispoll.com/briefs/location-sharing-features/",
          "https://www.businessinsider.com/life360-family-safety-app-sells-user-location-data-report-2021-12",
          "https://www.businessinsider.com/gabb-smartphone-review-teens-kids-social-media-2024-8",
          "https://www.businessinsider.com/gen-z-happy-parents-tracking-location-apps-life360-2023-10",
          "https://www.businessinsider.com/helicopter-parent-son-went-college-2024-5",
          "https://www.theatlantic.com/family/archive/2024/07/modern-parenting-grown-children/678942/",
          "https://www.pewresearch.org/social-trends/2024/01/25/parents-young-adult-children-and-the-transition-to-adulthood/",
          "https://nypost.com/2024/09/04/us-news/next-level-helicopter-parents-track-their-adult-children-interfere-in-roommate-conflicts/",
          "https://www.businessinsider.com/millennials-gen-z-tracking-parents-location-sharing-phones-helicopter-parenting-2024-9",
          "https://www.businessinsider.nl/heeft-de-waterstofauto-een-toekomst-we-probeerden-het-uit-met-de-bmw-ix5-hydrogen/",
          "https://www.businessinsider.nl/waarom-topbelegger-warren-buffet-zich-geen-zorgen-maakt-over-hoe-de-economie-het-doet/",
          "https://www.businessinsider.nl/de-aarde-krijgt-gedurende-57-dagen-een-tweede-maan-dit-is-wat-je-moet-weten/",
          "https://www.businessinsider.nl/fotos-tonen-hoe-mar-a-lago-eruit-zag-voor-trump-het-kocht/",
          "https://www.businessinsider.nl/regering-italie-vindt-dat-duitsland-niet-moet-zeuren-als-grote-italiaanse-bank-een-duitse-bank-wil-overnemen/",
          "https://www.businessinsider.nl/china-krijgt-voordeel-van-de-twijfel-bij-pogingen-om-economie-aan-te-jagen-laat-stijging-renminbi-zien/"
        ],
        "image": "https://i.insider.com/66f186dfd17aa3c7b2b4f609?format=jpeg",
        "eventUri": null,
        "sentiment": -0.04313725490196074,
        "wgt": 465041466,
        "relevance": 1
      },
      {
        "uri": "8337911523",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "10:10:12",
        "dateTime": "2024-09-26T10:10:12Z",
        "dateTimePub": "2024-09-26T10:09:23Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://www.cnet.com/tech/services-and-software/the-passwordless-future-is-here-how-to-set-up-a-passkey-for-your-google-account/",
        "title": "The Passwordless Future Is Here: How to Set Up a Passkey for Your Google Account",
        "body": "Nelson Aguilar is an LA-based tech how-to writer and graduate of UCLA. With more than a decade of experience, he covers Apple and Google and writes on iPhone and Android features, privacy and security settings and more.\n\nAt this point, you're probably aware of what Passkeys are -- the FIDO Alliance-developed authentication method that was quickly adopted by the likes of Apple, Google and Microsoft. While adoption hasn't been the fastest, passkeys are slowly becoming the \"solution\" to passwords, offering more security and giving users one less thing to worry about -- an overly long and complicated password to remember.\n\nAt the forefront of the passkey push is Google, which offers easy ways to set up and sync your passkeys across devices through the Chrome browser. If you're new to passkeys and want to get started, one of the best places to begin is creating one for your Google account -- because you obviously have one of those.\n\nBelow, we'll show you how to set up a passkey for your Google account and get a glimpse of the passwordless future tech giants are promising us. For more, don't miss what you need to know about your iPhone's new RCS support and this nifty hack to free up space in your Gmail account without deleting all of your emails.\n\nBefore you set up your Google passkeys, you must meet the following requirements, which vary depending on what device you're using.\n\nIn the web browser of your choice -- on your phone, tablet or computer -- head over to g.co/passkeys. If you're already logged in to your current Google account, you'll be asked to enter your normal password to verify your identity. If you need to switch accounts, tap the current email to choose from all your other Google accounts.\n\nNow enter your password when prompted, and hit Next. On the following page, you'll be asked to create a passkey. When the pop-up appears, hit Continue. The passkey will be saved to your device (for example, iCloud Keychain on iOS), which varies depending on your device.\n\nYou'll need to follow any prompts and use whatever biometric your device asks to confirm your identity. Once you do, your passkey will be created for that device.\n\nNote: There is an option to create a passkey using another device (tablet, external security key), but the easiest method is to just create the passkey on the device you're using.\n\nYou can now use your passkey to log in to your Google account. If you have two-factor authentication enabled, your passkey bypasses 2FA because a passkey means you have physical possession of your phone, which is what 2FA essentially does. Also, if you don't want to use your passkey for any reason, you can always use your password to log in.\n\nIf for any reason you lose your device or have it stolen, you can still log in to your Google account. Using another device that has access to your Google account: Go to g.co/passkeys, sign in to your account using your usual password and remove the passkey associated with your lost or stolen device. Just hit the X next to the passkey and then hit Remove to get rid of it and go back to using your password.",
        "source": {
          "uri": "cnet.com",
          "dataType": "news",
          "title": "CNET"
        },
        "authors": [
        ],
        "links": [
          "https://fidoalliance.org/apple-google-and-microsoft-commit-to-expanded-support-for-fido-standard-to-accelerate-availability-of-passwordless-sign-ins/",
          "https://www.cnet.com/tech/mobile/switch-to-passkeys-more-secure-than-passwords-on-ios-16-iphone-14/",
          "https://www.cnet.com/tech/services-and-software/googles-new-passkey-login-helps-you-break-free-of-passwords/",
          "https://www.cnet.com/tech/services-and-software/google-moves-closer-to-a-future-without-passwords-with-passkey-syncing/",
          "https://www.cnet.com/tech/services-and-software/how-passkeys-will-usher-in-a-safer-passwordless-future/",
          "https://www.cnet.com/tech/services-and-software/ios-18-what-you-need-to-know-about-rcs-messaging-on-your-iphone/",
          "https://www.cnet.com/tech/services-and-software/gmail-inbox-full-clear-space-and-score-15gb-of-free-storage/",
          "https://www.anrdoezrs.net/links/3586864/type/dlg/sid/subid_value/https://store.google.com/us/product/titan_security_key?hl=en-US",
          "http://g.co/passkeys",
          "https://www.cnet.com/tech/services-and-software/ios-18-boost-your-iphones-security-by-locking-and-hiding-apps/",
          "https://www.cnet.com/tech/services-and-software/new-iphone-16-first-change-these-7-settings-in-ios-18/"
        ],
        "image": "https://www.cnet.com/a/img/resize/c3ad45754ab89bd66853ea423e227710cf3d35d8/hub/2022/08/25/f0a2866b-e71b-40d6-9c3d-2d0c873b3407/gettyimages-1242657903.jpg?auto=webp&fit=crop&height=675&width=1200",
        "eventUri": null,
        "sentiment": 0.3647058823529412,
        "wgt": 465041412,
        "relevance": 2
      },
      {
        "uri": "8337909558",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2024-09-26",
        "time": "10:09:27",
        "dateTime": "2024-09-26T10:09:27Z",
        "dateTimePub": "2024-09-26T10:08:15Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://www.eastoregonian.com/online_features/press_releases/imemories-revolutionizes-analog-memory-digitization-with-ai-enhancement-technology/article_e7f68820-c33b-572b-adea-a2f931725050.html",
        "title": "iMemories Revolutionizes Analog Memory Digitization with AI Enhancement Technology",
        "body": "- McKenzie™ AI Enhances Decades-Old Memories to Stunning Clarity -\n\nSCOTTSDALE, Ariz., Sept. 25, 2024 /PRNewswire/ -- Leading home movie digitization and social entertainment company iMemories has leveled-up its services, now offering an impressive AI image enhancement that produces unprecedented results when digitizing home movies dating back as far as the 1960s. The company's groundbreaking new McKenzie AI technology achieves amazing results for customers, allowing them to experience cherished memories from past generations with up to three times the visual clarity of the original video.\n\niMemories launches McKenzie AI to transform decades-old home movies with stunning clarity\n\nFor customers with cherished analog memories captured on decades-old technologies -- from the graininess of 8mm and Super 8 films to the noisy visuals of VHS and Hi8 tapes -- iMemories now leverages its revolutionary McKenzie AI technology to transform these precious moments with unprecedented clarity. This groundbreaking innovation intelligently addresses the unique visual imperfections inherent in each analog format. It cleans up visual noise, restores faded colors, sharpens blurred images, and addresses challenges such as color bleeding and image distortion. By overcoming the limitations and quality issues previously encountered when converting older media to digital, McKenzie AI breathes new life into treasured memories, allowing families to relive them with stunning visual fidelity.\n\n\"McKenzie AI enhancement by iMemories represents a monumental breakthrough in the preservation of cherished memories,\" said iMemories founder and CEO Mark Rukavina. \"We are thrilled to unveil this revolutionary AI technology that transforms decades-old analog media into stunningly clear digital experiences, rivaling the quality of modern recordings. For the first time, families can see their loved ones' faces and emotions with a clarity that was previously unimaginable, making the viewing experience profoundly more enjoyable and impactful. When I founded iMemories 20 years ago, I never dreamed something like this was possible -- but here we are, introducing a remarkable AI innovation that is redefining the digitization industry and bringing history back to life.\"\n\nEnhancing the immense benefits of this groundbreaking technology, McKenzie AI has been meticulously engineered to seamlessly integrate with iMemories' exclusive streaming and sharing platform. Now, newly enhanced memories are not only clearer than ever but also instantly accessible across an unparalleled range of devices. Whether you're using an iPhone, iPad, Android phone or tablet, PC or Mac, or enjoying the big screen experience on Smart TVs from Samsung, LG, Sony, TCL, and HiSense, as well as streaming media devices like Apple TV, Amazon Fire TV, Google TV, and Roku, iMemories ensures your treasured moments are always within reach. This powerful fusion of cutting-edge AI enhancement and universal streaming capability further solidifies iMemories' position as the world's leading social entertainment company. By offering pristine digitized memories with the unparalleled convenience of viewing on any device -- including your big-screen TV -- iMemories is redefining how families relive and share their most cherished moments.\n\n\"McKenzie AI is more than just a technological advancement -- it's a revolution in how we reconnect with our most precious memories,\" said Steve Krell, President and COO of iMemories. \"For years, we've been committed to preserving the past for our customers, but now we're elevating those memories to a level of clarity and detail once thought impossible. This groundbreaking technology allows families to see and experience their history with fresh eyes, revealing nuances and emotions that may have been hidden for decades. McKenzie AI embodies iMemories' relentless pursuit of excellence and our dedication to bringing the best possible experience to those who entrust us with their life's most meaningful moments.\"\n\nMcKenzie AI comes on the heels of iMemories being named a Fast Company World's Most Innovative Company for video in 2023 -- a coveted designation that cemented iMemories as the pioneer of social entertainment.\n\nLearn more about iMemories at https://www.imemories.com.\n\nAbout iMemories\n\niMemories is the leading social entertainment company dedicated to transforming how the world preserves and experiences cherished memories. Founded 20 years ago, iMemories specializes in digitizing analog media and enhancing it with cutting-edge technology, making priceless moments accessible and shareable for generations to come. Committed to excellence and driven by a passion for preserving the past, iMemories combines innovative solutions with universal accessibility, ensuring that your most treasured memories are more vivid and readily available than ever before. For more information, visit https://www.imemories.com.\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/imemories-revolutionizes-analog-memory-digitization-with-ai-enhancement-technology-302258779.html\n\nSOURCE iMemories",
        "source": {
          "uri": "eastoregonian.com",
          "dataType": "news",
          "title": "East Oregonian"
        },
        "authors": [
        ],
        "links": [
          "https://c212.net/c/link/?t=0&l=en&o=4263354-1&h=1318393007&u=https%3A%2F%2Fwww.fastcompany.com%2Fmost-innovative-companies%2Flist&a=World%27s+Most+Innovative+Company",
          "https://c212.net/c/link/?t=0&l=en&o=4263354-1&h=170652146&u=https%3A%2F%2Fwww.imemories.com%2F&a=https%3A%2F%2Fwww.imemories.com",
          "https://www.prnewswire.com/news-releases/imemories-revolutionizes-analog-memory-digitization-with-ai-enhancement-technology-302258779.html"
        ],
        "image": "https://bloximages.newyork1.vip.townnews.com/eastoregonian.com/content/tncms/assets/v3/editorial/8/f8/8f8ba9d9-f7c1-5353-903e-8cbaffc82225/66f52adaea6f1.image.jpg?crop=1773%2C931%2C0%2C119&resize=438%2C230&order=crop%2Cresize",
        "eventUri": null,
        "sentiment": 0.6470588235294117,
        "wgt": 465041367,
        "relevance": 1
      },
      {
        "uri": "8337910854",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "10:09:19",
        "dateTime": "2024-09-26T10:09:19Z",
        "dateTimePub": "2024-09-26T10:08:57Z",
        "dataType": "news",
        "sim": 0.6274510025978088,
        "url": "https://www.foxnews.com/health/apple-watch-could-help-you-uncover-hidden-sleep-apnea",
        "title": "Apple Watch could help you uncover hidden sleep apnea",
        "body": "A game-changing feature could help you identify a hidden health issue right from your wrist.\n\nDo you often wake up feeling exhausted, even after a full night's sleep? You might be one of the millions of people unknowingly living with sleep apnea. But here's some great news. Apple has just introduced a game-changing feature that could help you identify this hidden health issue right from your wrist.\n\nIf you own an Apple Watch Series 10, 9 or Ultra 2, you'll soon have a personal sleep detective on your arm. This new feature uses the watch's built-in technology to monitor your breathing patterns while you sleep, looking for signs that could indicate sleep apnea.\n\nNo more need for complicated sleep studies or expensive equipment; your everyday smartwatch could be the key to uncovering this common but often undiagnosed condition.\n\nGET SECURITY ALERTS, EXPERT TIPS - SIGN UP FOR KURT'S NEWSLETTER - THE CYBERGUY REPORT HERE\n\nThe sleep apnea detection feature utilizes the watch's built-in accelerometer to monitor a new metric called \"breathing disturbances\" during sleep. By analyzing these disturbances over time, the watch can identify patterns consistent with moderate to severe sleep apnea.\n\nAPPLE TRANSFORMS AIRPODS PRO 2 INTO LOW-COST HEARING AIDS\n\nThe U.S. Food and Drug Administration (FDA) has granted approval for this sleep apnea feature, marking a significant milestone in wearable health technology. Apple plans to roll out the functionality to more than 150 countries and regions this month, including the United States, Europe and Japan.\n\nAPPLE'S BOLD MOVE INTO AI: NEW IPHONE 16, AIRPODS AND WATCHES\n\nYou can view your nightly breathing disturbance data in the Health app on your iPhone, where it will be categorized as either \"elevated\" or \"not elevated.\" The watch analyzes this data over a 30-day period and notifies users if it detects consistent signs of sleep apnea.\n\nIOS 18: DISCOVER THE NEW FEATURES IN APPLE'S LATEST OPERATING SYSTEM\n\nIn clinical validation studies, the notification performance achieved a sensitivity of 66.3% and specificity of 98.5%. This means that while the algorithm is effective at identifying those with moderate to severe sleep apnea, it also minimizes false positives, ensuring that you can trust the notifications you receive.\n\nHOW TO REMOVE YOUR PRIVATE DATA FROM THE INTERNET\n\nTOP SLEEP ACCESSORIES 2024\n\nDr. Sumbul Desai, Apple's vice president of health, emphasized the rigorous development process behind this feature. The detection algorithm was created using advanced machine learning with extensive datasets from clinical-grade sleep apnea tests. The studies included diverse participants across various demographics and evaluated both at-home and in-lab sleeping environments.\n\nThis new feature has the potential to significantly impact public health by helping identify undiagnosed cases of sleep apnea. Research suggests that up to 80% of sleep apnea cases remain undiagnosed, making this tool invaluable for many people who may not exhibit obvious symptoms.\n\nTHE HIDDEN COSTS OF FREE APPS: YOUR PERSONAL INFORMATION\n\nTo use the new sleep apnea detection feature on your Apple Watch, follow these steps:\n\nEnsure your Apple Watch is running the latest version of watchOS. Here are the steps:\n\nUpdate your iPhone to the latest iOS version. Here are the steps:\n\nRemember, this feature is designed for users 18 years or older who have not been diagnosed with sleep apnea. If you receive a notification suggesting signs of sleep apnea, it's important to consult with your health care provider for proper evaluation and diagnosis.\n\nSUBSCRIBE TO KURT'S YOUTUBE CHANNEL FOR QUICK VIDEO TIPS ON HOW TO WORK ALL OF YOUR TECH DEVICES\n\nIt's incredible how technology can empower us to take charge of our health, and the new sleep apnea detection feature on the Apple Watch 10, 9 and Ultra 2 is a perfect example. With this tool, you can monitor your breathing patterns while you sleep, potentially uncovering issues that have gone unnoticed for far too long. Just remember, while this feature is a fantastic step toward better health, it's essential to consult with a health care provider if you receive a notification about possible sleep apnea. Embracing these advancements could lead to a more restful night and a healthier life.\n\nHow do you feel about using wearable technology like the Apple Watch for health monitoring? Are you excited about these advancements, or do you have concerns about privacy and accuracy? Let us know by writing us at Cyberguy.com/Contact.\n\nFor more of my tech tips and security alerts, subscribe to my free CyberGuy Report Newsletter by heading to Cyberguy.com/Newsletter.\n\nAsk Kurt a question or let us know what stories you'd like us to cover.",
        "source": {
          "uri": "foxnews.com",
          "dataType": "news",
          "title": "Fox News"
        },
        "authors": [
          {
            "uri": "kurt_knutsson@foxnews.com",
            "name": "Kurt Knutsson",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://www.foxnews.com/video/6362453254112",
          "https://www.foxnews.com/health/sleep-apnea-patients-see-improvement-breathing-tool",
          "https://www.foxnews.com/health",
          "https://cyberguy.com/Newsletter/"
        ],
        "image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/09/1024/512/1-The-Apple-Watch-could-help-you-uncover-hidden-sleep-apnea.jpg?ve=1&tl=1",
        "eventUri": "eng-9939093",
        "sentiment": 0.05882352941176472,
        "wgt": 465041359,
        "relevance": 5
      },
      {
        "uri": "8337909506",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2024-09-26",
        "time": "10:08:34",
        "dateTime": "2024-09-26T10:08:34Z",
        "dateTimePub": "2024-09-26T10:08:14Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://uk.investing.com/news/company-news/tsmc-shares-hold-as-jpmorgan-reiterates-overweight-rating-93CH-3708326",
        "title": "TSMC shares hold as JPMorgan reiterates overweight rating By Investing.com",
        "body": "On Thursday, JPMorgan (NYSE:JPM) maintained its Overweight rating and NT$1,200.00 price target on Taiwan Semiconductor Manufacturing Company (2330:TT) (NYSE:TSM), citing expectations for a robust third-quarter earnings report.\n\nThe firm anticipates that TSMC's revenue will slightly exceed the upper end of the company's forecast, with projected revenues of US $23.3 billion against guidance of US$22.4-23.2 billion. Gross margins (GMs) are also expected to be at the high end of TSMC's forecast, with an estimate of 54.8% compared to the projected range of 53.5-55.5%.\n\nThe positive outlook is partly attributed to the strong growth in the N3 technology node, which is used for the latest iPhone builds and new application processors from companies like Mediatek and Qualcomm (NASDAQ:QCOM). Additionally, the N4 node, primarily utilized for AI accelerators, is expected to contribute to the company's revenue growth. JPMorgan forecasts a quarter-over-quarter revenue increase of approximately 10% for the fourth quarter of 2024 due to these factors.\n\nJPMorgan also anticipates that TSMC will continue to communicate strong demand trends for its N3 technology and a persistent supply-demand gap for advanced packaging solutions, particularly the Chip on Wafer on Substrate (CoWoS) technology.\n\nThe firm's outlook is bolstered by the expectation that 2025 will be a strong year for TSMC. This optimism is based on the sustained demand for AI accelerators, the expansion of N3 engagements beyond Apple (NASDAQ:AAPL), and an anticipated uptick in gross margins due to improved yields and potential price increases for the N3E technology node.\n\nIn other recent news, Taiwan Semiconductor Manufacturing Co. Ltd. (TSMC) has reported significant growth in its second quarter of 2024, with a sequential revenue increase of 13.6% in NT dollars and 10.3% in USD. The company's gross margin rose to 53.2%, and its operating margin reached 42.5%. TSMC's High-Performance Computing (HPC) segment accounted for more than half of the total revenue for the first time, standing at 52%. The company revised its full-year revenue guidance to a growth rate slightly above the mid-20s percent in USD terms.\n\nBofA Securities maintained a positive outlook on TSMC, reiterating a Buy rating. The firm highlighted the upcoming delivery of a high-numerical aperture extreme ultraviolet (EUV) lithography tool to TSMC from ASML (AS:ASML), which is expected to enhance the company's capabilities in developing advanced semiconductor processes. TSMC's August financial report showed a revenue of NT$251 billion, a 2% decrease month-over-month but a 33% increase year-over-year.\n\nBernstein SocGen Group updated its outlook on TSMC, increasing the price target to $220 from the previous $200, and retaining an Outperform rating on the stock. The firm suggests TSMC is well-positioned to perform better than its peers should a recession occur, due to its advanced technologies and market share gains. Finally, TSMC's capital expenditure for 2024 is projected to be between USD 30 billion and USD 32 billion, primarily allocated to advanced process technologies.\n\nAs Taiwan Semiconductor Manufacturing Company (TSM) approaches its next earnings date on October 17, 2024, the company's financial health and market performance remain a focal point for investors. With a market capitalization of $803.45 billion and a P/E ratio of 27.72, TSMC stands as a significant player in the semiconductor industry. In the last twelve months as of Q2 2024, TSMC has reported a revenue growth of 9.44%, showcasing its ability to expand amidst a dynamic tech landscape. This is further evidenced by a substantial quarterly revenue growth of 40.07% in Q2 2024, highlighting the company's strong performance in the short term.\n\nInvestingPro Tips suggest that TSMC's robust gross profit margin of 53.36% aligns with JPMorgan's expectations of high-end gross margins for the company. Additionally, with a dividend growth of 42.6% in the same period, TSMC demonstrates its commitment to returning value to shareholders. It's worth noting that the InvestingPro product lists 15 additional tips that can provide deeper insights into TSM's financial health and investment potential.\n\nInvestors may also find TSMC's price resilience of interest, with the stock trading at 94.25% of its 52-week high. This, combined with a year-to-date price total return of 76.84%, positions TSMC favorably in the eyes of growth-oriented investors. The company's fair value, as assessed by analysts, stands at $214, while InvestingPro's fair value estimation is at $161.5, offering a perspective on the stock's potential undervaluation or overvaluation.",
        "source": {
          "uri": "uk.investing.com",
          "dataType": "news",
          "title": "Investing.com UK"
        },
        "authors": [
        ],
        "links": [
          "https://www.investing.com/pro/pricing?referral=inv_in_article_anchor"
        ],
        "image": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
        "eventUri": null,
        "sentiment": 0.3176470588235294,
        "wgt": 465041314,
        "relevance": 1
      },
      {
        "uri": "8337902827",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "10:04:37",
        "dateTime": "2024-09-26T10:04:37Z",
        "dateTimePub": "2024-09-26T10:04:22Z",
        "dataType": "news",
        "sim": 0.800000011920929,
        "url": "https://www.digitaltrends.com/mobile/how-to-customize-camera-control-on-iphone-16/",
        "title": "How to customize the Camera Control on your iPhone 16 | Digital Trends",
        "body": "Apple's latest and greatest iPhone 16 line is now available. The base model iPhone 16 and iPhone 16 Plus now have the Action button and a more powerful A18 chip, while the iPhone 16 Pro and iPhone 16 Pro Max have improved ultrawide cameras and the A18 Pro chip. All of the iPhone 16 phones can run Apple Intelligence once that is released in iOS 18.1 coming in October, and all models also have the new Camera Control.\n\nContents How to change what the Camera Control doesHow to adjust the Camera Control's sensitivity Recommended Videos Difficulty Easy Duration 5 minutes What You Need\n\nAny iPhone 16 model\n\nThe Camera Control is a new physical button with touch control capabilities that sits flush on the bottom right of the iPhone 16 frame. By default, it will launch the Camera app, act as a shutter button, and allow you to adjust various camera settings.\n\nBut did you know you can also customize it in a few different ways? You can! Here's how.\n\nHow to change what the Camera Control does\n\nWith the Camera Control, the default setting is that a single click launches the Camera app, but you can change that if you wish. Here's what you need to do:\n\nStep 1: Open Settings on your iPhone 16.\n\nStep 2: Select Camera.\n\nStep 3: Select Camera Control.\n\nStep 4: The Clean Preview is on by default. This will hide the rest of the Camera interface (changing modes, zoom, image preview, etc.) while you use the Camera Control. If you don't like this, simply turn the toggle to OFF position.\n\nStep 5: Under Launch Camera, you can choose whether you want it to be a single click or a double click.\n\nStep 6: Lastly, you can change the app that opens with your preferred click setting for the Camera Control. The default is Camera, but you can also open Code Scanner, Magnifier, and select third-party apps that have supported Camera Control, like Halide and Instagram.\n\nHow to adjust the Camera Control's sensitivity\n\nAs you start to use Camera Control, you may not be satisfied with the default sensitivity setting to activate it. Thankfully, this can be changed to make it easier to use, or you can turn it off entirely if you're not a fan.\n\nStep 1: Open Settings on your iPhone 16.\n\nStep 2: Select Accessibility.\n\nStep 3: Select Camera Control.\n\nStep 4: If you want to disable Camera Control, just change the toggle for Camera Control to OFF. Now nothing will happen when you press Camera Control.\n\nStep 5: If you don't want to use the Camera Control to make adjustments when using the camera, switch the Show Adjustments toggle to OFF.\n\nStep 6: You can change the pressure sensitivity of Camera Control to Lighter (easier) or Firmer (harder). It is on Default normally.\n\nStep 7: You can also change the speed of the double light-press to Slow or Slower.\n\nAnd that's all there is to it! The Camera Control is a really helpful tool out of the box, but you can make it work even better for yourself with a few small tweaks. Have fun!",
        "source": {
          "uri": "digitaltrends.com",
          "dataType": "news",
          "title": "Digital Trends"
        },
        "authors": [
          {
            "uri": "christine_romero_chan@digitaltrends.com",
            "name": "Christine Romero-Chan",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://www.digitaltrends.com/mobile/iphone-16-review/",
          "https://www.digitaltrends.com/mobile/iphone-15-pro-action-button-10-awesome-things-you-can-do/",
          "https://www.digitaltrends.com/mobile/apple-iphone-16-pro-announced-specs-features-price/",
          "https://www.digitaltrends.com/mobile/every-ai-apple-intelligence-feature-coming-to-iphone-in-ios-18/",
          "https://www.digitaltrends.com/mobile/apple-just-launched-ios-18-1-public-beta-apple-intelligence-features/",
          "https://www.digitaltrends.com/mobile/everything-you-can-do-with-iphone-16-camera-control-button/",
          "https://www.digitaltrends.com/mobile/iphone/",
          "https://www.digitaltrends.com/users/cchan/",
          "https://www.digitaltrends.com/mobile/iphone-16-pro-max-bend-test/",
          "https://www.digitaltrends.com/mobile/best-apple-iphone-16-pro-max-cases/",
          "https://www.digitaltrends.com/mobile/apple-iphone-16-pro-vs-apple-iphone-14-pro/"
        ],
        "image": "https://www.digitaltrends.com/wp-content/uploads/2024/09/iphone-16-review-8.jpeg?resize=800%2C418&p=1",
        "eventUri": "eng-9932329",
        "sentiment": 0.2941176470588236,
        "wgt": 465041077,
        "relevance": 4
      },
      {
        "uri": "8337897903",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "10:01:27",
        "dateTime": "2024-09-26T10:01:27Z",
        "dateTimePub": "2024-09-26T10:01:14Z",
        "dataType": "news",
        "sim": 0.5803921818733215,
        "url": "https://www.newsx.com/offbeat/iphone-15-for-%e2%82%b949999-grab-it-at-flipkarts-big-billion-days-sale/",
        "title": "iPhone 15 for ₹49,999? Grab It At Flipkart's Big Billion Days Sale!",
        "body": "With Apple's recent launch of next-generation iPhones, now is an opportune moment for consumers in India to purchase older models at significantly reduced prices.\n\nWith Apple's recent launch of next-generation iPhones, now is an opportune moment for consumers in India to purchase older models at significantly reduced prices. As the festive season approaches, major online retailers are eager to provide attractive deals, particularly leading up to Diwali.\n\nWalmart-owned Flipkart is set to roll out impressive deals on iPhones during its Big Billion Days 2024 sale, commencing September 27, 2024. Excitingly, Flipkart Plus subscribers will gain early access to these offers starting September 26.\n\nREAD MORE: Watch: Heroic Cop Rescues Man From Train Accident At Mumbai Station\n\nThis year, Flipkart has revealed enticing discounts on popular models, including the iPhone 15 Pro, iPhone 15 Pro Max, and iPhone 15. These flagship devices are expected to see price reductions following the anticipated release of the iPhone 16.\n\nDuring the sale, the iPhone 15 Pro will be available at a net effective price of Rs 89,999, down from an MRP of Rs 1,09,900 -- a discount of Rs 19,901. Meanwhile, the iPhone 15 Pro Max will be offered at Rs 1,09,999, reflecting a Rs 24,901 reduction from its MRP of Rs 1,34,900.\n\nThe iPhone 15 Pro will have a sale price of Rs 99,999, while the iPhone 15 Pro Max will be priced at Rs 1,19,999. In addition to these reductions, Flipkart is providing an additional Rs 10,000 discount, comprised of a Rs 5,000 bank offer and another Rs 5,000 off for exchanges. This brings the effective prices down to Rs 89,999 and Rs 1,09,999, respectively.\n\nEven with the launch of the iPhone 16 series, the iPhone 15 Pro and Pro Max remain excellent choices due to their significantly reduced prices. Although the newer models offer enhanced cameras and battery life, the older models provide great value for money.\n\nThe iPhone 15 will also see notable price cuts, starting at Rs 49,999 during the Flipkart sale. This includes a flat discount of Rs 14,901 against an MRP of Rs 69,900, along with an additional Rs 5,000 discount, comprising a Rs 2,000 HDFC Bank offer and Rs 3,000 off on exchanges.\n\nFor those looking for an even more affordable option, the iPhone 12 Mini will be available for just Rs 19,999. This price point makes the device accessible to a wider audience, provided that Flipkart has sufficient stock.\n\nThe upcoming Flipkart Big Billion Days 2024 sale presents a fantastic opportunity to purchase iPhones at remarkable discounts. Whether you're eyeing the iPhone 15, 15 Pro, or even the iPhone 12 Mini, these deals offer a chance to acquire premium devices at more affordable prices just in time for the festive season.",
        "source": {
          "uri": "newsx.com",
          "dataType": "news",
          "title": "NewsX"
        },
        "authors": [
          {
            "uri": "prateek_levi@newsx.com",
            "name": "Prateek Levi",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
        ],
        "image": "https://www.newsx.com/wp-content/uploads/2024/09/iPhone-15-for-₹49999-Grab-It-At-Flipkarts-Big-Billion-Days-Sale.webp",
        "eventUri": "eng-9928415",
        "sentiment": 0.419607843137255,
        "wgt": 465040887,
        "relevance": 5
      },
      {
        "uri": "8337889005",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "09:55:27",
        "dateTime": "2024-09-26T09:55:27Z",
        "dateTimePub": "2024-09-26T09:55:00Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://www.investing.com/news/company-news/tsmc-shares-hold-as-jpmorgan-reiterates-overweight-rating-93CH-3633434",
        "title": "TSMC shares hold as JPMorgan reiterates overweight rating By Investing.com",
        "body": "On Thursday, JPMorgan maintained its Overweight rating and NT$1,200.00 price target on Taiwan Semiconductor Manufacturing Company (2330:TT) (NYSE:TSM), citing expectations for a robust third-quarter earnings report.\n\nThe firm anticipates that TSMC's revenue will slightly exceed the upper end of the company's forecast, with projected revenues of US $23.3 billion against guidance of US$22.4-23.2 billion. Gross margins (GMs) are also expected to be at the high end of TSMC's forecast, with an estimate of 54.8% compared to the projected range of 53.5-55.5%.\n\nThe positive outlook is partly attributed to the strong growth in the N3 technology node, which is used for the latest iPhone builds and new application processors from companies like Mediatek and Qualcomm (NASDAQ:QCOM). Additionally, the N4 node, primarily utilized for AI accelerators, is expected to contribute to the company's revenue growth. JPMorgan forecasts a quarter-over-quarter revenue increase of approximately 10% for the fourth quarter of 2024 due to these factors.\n\nJPMorgan also anticipates that TSMC will continue to communicate strong demand trends for its N3 technology and a persistent supply-demand gap for advanced packaging solutions, particularly the Chip on Wafer on Substrate (CoWoS) technology.\n\nThe firm's outlook is bolstered by the expectation that 2025 will be a strong year for TSMC. This optimism is based on the sustained demand for AI accelerators, the expansion of N3 engagements beyond Apple (NASDAQ:AAPL), and an anticipated uptick in gross margins due to improved yields and potential price increases for the N3E technology node.\n\nIn other recent news, Taiwan Semiconductor Manufacturing Co. Ltd. (TSMC) has reported significant growth in its second quarter of 2024, with a sequential revenue increase of 13.6% in NT dollars and 10.3% in USD. The company's gross margin rose to 53.2%, and its operating margin reached 42.5%. TSMC's High-Performance Computing (HPC) segment accounted for more than half of the total revenue for the first time, standing at 52%. The company revised its full-year revenue guidance to a growth rate slightly above the mid-20s percent in USD terms.\n\nBofA Securities maintained a positive outlook on TSMC, reiterating a Buy rating. The firm highlighted the upcoming delivery of a high-numerical aperture extreme ultraviolet (EUV) lithography tool to TSMC from ASML (AS:ASML), which is expected to enhance the company's capabilities in developing advanced semiconductor processes. TSMC's August financial report showed a revenue of NT$251 billion, a 2% decrease month-over-month but a 33% increase year-over-year.\n\nBernstein SocGen Group updated its outlook on TSMC, increasing the price target to $220 from the previous $200, and retaining an Outperform rating on the stock. The firm suggests TSMC is well-positioned to perform better than its peers should a recession occur, due to its advanced technologies and market share gains. Finally, TSMC's capital expenditure for 2024 is projected to be between USD 30 billion and USD 32 billion, primarily allocated to advanced process technologies.\n\nAs Taiwan Semiconductor Manufacturing Company (TSM) approaches its next earnings date on October 17, 2024, the company's financial health and market performance remain a focal point for investors. With a market capitalization of $803.45 billion and a P/E ratio of 27.72, TSMC stands as a significant player in the semiconductor industry. In the last twelve months as of Q2 2024, TSMC has reported a revenue growth of 9.44%, showcasing its ability to expand amidst a dynamic tech landscape. This is further evidenced by a substantial quarterly revenue growth of 40.07% in Q2 2024, highlighting the company's strong performance in the short term.\n\nInvestingPro Tips suggest that TSMC's robust gross profit margin of 53.36% aligns with JPMorgan's expectations of high-end gross margins for the company. Additionally, with a dividend growth of 42.6% in the same period, TSMC demonstrates its commitment to returning value to shareholders. It's worth noting that the InvestingPro product lists 15 additional tips that can provide deeper insights into TSM's financial health and investment potential.\n\nInvestors may also find TSMC's price resilience of interest, with the stock trading at 94.25% of its 52-week high. This, combined with a year-to-date price total return of 76.84%, positions TSMC favorably in the eyes of growth-oriented investors. The company's fair value, as assessed by analysts, stands at $214, while InvestingPro's fair value estimation is at $161.5, offering a perspective on the stock's potential undervaluation or overvaluation.",
        "source": {
          "uri": "investing.com",
          "dataType": "news",
          "title": "Investing.com"
        },
        "authors": [
        ],
        "links": [
          "https://www.investing.com/pro/pricing?referral=inv_in_article_anchor"
        ],
        "image": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
        "eventUri": null,
        "sentiment": 0.3176470588235294,
        "wgt": 465040527,
        "relevance": 1
      },
      {
        "uri": "8337882459",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "09:51:37",
        "dateTime": "2024-09-26T09:51:37Z",
        "dateTimePub": "2024-09-26T09:50:40Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://www.dailyrepublic.com/online_features/press_releases/imemories-revolutionizes-analog-memory-digitization-with-ai-enhancement-technology/article_febdadcb-d491-56b8-98f0-24840243dd42.html",
        "title": "iMemories Revolutionizes Analog Memory Digitization with AI Enhancement Technology",
        "body": "- McKenzie™ AI Enhances Decades-Old Memories to Stunning Clarity -\n\nSCOTTSDALE, Ariz., Sept. 25, 2024 /PRNewswire/ -- Leading home movie digitization and social entertainment company iMemories has leveled-up its services, now offering an impressive AI image enhancement that produces unprecedented results when digitizing home movies dating back as far as the 1960s. The company's groundbreaking new McKenzie AI technology achieves amazing results for customers, allowing them to experience cherished memories from past generations with up to three times the visual clarity of the original video.\n\niMemories launches McKenzie AI to transform decades-old home movies with stunning clarity\n\nFor customers with cherished analog memories captured on decades-old technologies -- from the graininess of 8mm and Super 8 films to the noisy visuals of VHS and Hi8 tapes -- iMemories now leverages its revolutionary McKenzie AI technology to transform these precious moments with unprecedented clarity. This groundbreaking innovation intelligently addresses the unique visual imperfections inherent in each analog format. It cleans up visual noise, restores faded colors, sharpens blurred images, and addresses challenges such as color bleeding and image distortion. By overcoming the limitations and quality issues previously encountered when converting older media to digital, McKenzie AI breathes new life into treasured memories, allowing families to relive them with stunning visual fidelity.\n\n\"McKenzie AI enhancement by iMemories represents a monumental breakthrough in the preservation of cherished memories,\" said iMemories founder and CEO Mark Rukavina. \"We are thrilled to unveil this revolutionary AI technology that transforms decades-old analog media into stunningly clear digital experiences, rivaling the quality of modern recordings. For the first time, families can see their loved ones' faces and emotions with a clarity that was previously unimaginable, making the viewing experience profoundly more enjoyable and impactful. When I founded iMemories 20 years ago, I never dreamed something like this was possible -- but here we are, introducing a remarkable AI innovation that is redefining the digitization industry and bringing history back to life.\"\n\nEnhancing the immense benefits of this groundbreaking technology, McKenzie AI has been meticulously engineered to seamlessly integrate with iMemories' exclusive streaming and sharing platform. Now, newly enhanced memories are not only clearer than ever but also instantly accessible across an unparalleled range of devices. Whether you're using an iPhone, iPad, Android phone or tablet, PC or Mac, or enjoying the big screen experience on Smart TVs from Samsung, LG, Sony, TCL, and HiSense, as well as streaming media devices like Apple TV, Amazon Fire TV, Google TV, and Roku, iMemories ensures your treasured moments are always within reach. This powerful fusion of cutting-edge AI enhancement and universal streaming capability further solidifies iMemories' position as the world's leading social entertainment company. By offering pristine digitized memories with the unparalleled convenience of viewing on any device -- including your big-screen TV -- iMemories is redefining how families relive and share their most cherished moments.\n\n\"McKenzie AI is more than just a technological advancement -- it's a revolution in how we reconnect with our most precious memories,\" said Steve Krell, President and COO of iMemories. \"For years, we've been committed to preserving the past for our customers, but now we're elevating those memories to a level of clarity and detail once thought impossible. This groundbreaking technology allows families to see and experience their history with fresh eyes, revealing nuances and emotions that may have been hidden for decades. McKenzie AI embodies iMemories' relentless pursuit of excellence and our dedication to bringing the best possible experience to those who entrust us with their life's most meaningful moments.\"\n\nMcKenzie AI comes on the heels of iMemories being named a Fast Company World's Most Innovative Company for video in 2023 -- a coveted designation that cemented iMemories as the pioneer of social entertainment.\n\nLearn more about iMemories at https://www.imemories.com.\n\nAbout iMemories\n\niMemories is the leading social entertainment company dedicated to transforming how the world preserves and experiences cherished memories. Founded 20 years ago, iMemories specializes in digitizing analog media and enhancing it with cutting-edge technology, making priceless moments accessible and shareable for generations to come. Committed to excellence and driven by a passion for preserving the past, iMemories combines innovative solutions with universal accessibility, ensuring that your most treasured memories are more vivid and readily available than ever before. For more information, visit https://www.imemories.com.\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/imemories-revolutionizes-analog-memory-digitization-with-ai-enhancement-technology-302258779.html\n\nSOURCE iMemories",
        "source": {
          "uri": "dailyrepublic.com",
          "dataType": "news",
          "title": "Daily Republic"
        },
        "authors": [
        ],
        "links": [
          "https://c212.net/c/link/?t=0&l=en&o=4263354-1&h=1318393007&u=https%3A%2F%2Fwww.fastcompany.com%2Fmost-innovative-companies%2Flist&a=World%27s+Most+Innovative+Company",
          "https://c212.net/c/link/?t=0&l=en&o=4263354-1&h=170652146&u=https%3A%2F%2Fwww.imemories.com%2F&a=https%3A%2F%2Fwww.imemories.com",
          "https://www.prnewswire.com/news-releases/imemories-revolutionizes-analog-memory-digitization-with-ai-enhancement-technology-302258779.html"
        ],
        "image": "https://bloximages.chicago2.vip.townnews.com/dailyrepublic.com/content/tncms/assets/v3/editorial/d/bd/dbdf349f-0939-5ccd-8997-9315d7fe11cc/66f52c831d5d9.image.jpg?crop=1773%2C931%2C0%2C119&resize=1200%2C630&order=crop%2Cresize",
        "eventUri": null,
        "sentiment": 0.6470588235294117,
        "wgt": 465040297,
        "relevance": 1
      },
      {
        "uri": "8337878927",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "09:48:55",
        "dateTime": "2024-09-26T09:48:55Z",
        "dateTimePub": "2024-09-26T09:48:26Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://www.businessinsider.com/millennials-gen-z-tracking-parents-location-sharing-phones-helicopter-parenting-2024-9",
        "title": "Millennials and Gen Zers are now helicopter parenting their parents",
        "body": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now. Have an account? Log in.\n\n\"It was laughable, but I was shocked,\" Howard, 53, told me. \"To be honest, I didn't know how I felt about it.\"\n\nIt's a reversal from when Howard's children were young -- before the age of smartphones -- and she was the one keeping close tabs on them. \"If 15 minutes went by and they weren't at home, then that's when the panic mode set in,\" she said. \"Then I'm peeking out the window looking for them or I'm calling their friends.\"\n\nShe added: \"They knew, 'Mom's going to freak out if I come home a little late.'\" Her kids were rarely late.\n\nStill, she was taken aback by being tracked unknowingly, so she took to TikTok to jokingly express her grievances. \"This message is for all the grown kids out there,\" she said in the video. \"Stop stalking your parents!\" Her post racked up millions of views -- and comments claiming to be from adult children who keep tabs on their parents' whereabouts poured in.\n\nWhile parents have used location-tracking apps to keep an eye on their kids since the tech was invented, millennials and Gen Zers are now turning the all-seeing eye onto their parents. Among some families, tracking one another with apps like Apple's Find My and Life360 has become the norm. They see it as a fun way to stay connected and keep aging relatives safe. But when relationships turn awry or people start tracking others in secret, location sharing can easily turn into an invasion of privacy that family members come to resent.\n\nThese days, monitoring goes both ways. The kids who grew up with extra watchful parents are now carefully eyeing their parents' every move. The trackers have become the tracked.\n\nMost of the people I spoke with felt that tracking their family members afforded some relief about their safety. A 2022 poll by The Harris Poll and The New York Times found that one in six respondents reported always having location sharing turned on, and 37% of those who said they used location-sharing apps (like Find My) said doing so made them feel safer. Just last year, Life360, one of the most prominent tracking apps, reported 50 million monthly active users, with downloads in the US doubling since 2021 as it gained popularity among Gen Zers. And increasingly, safety concerns are extending up a generation -- kids are now concerned about their parents rather than just the other way around.\n\nGrowing up in West Virginia, Kacy Shafer had \"pretty protective\" parents, she said. She was an only child and her dad served in the military, so it was mostly her mother who laid down the rules.\n\n\"I wasn't allowed to just go have playdates wherever I wanted -- she had to call the parents, make sure they would be there,\" Shafer, who is 29, said. While phones lacked tracking technology when Shafer was younger, her parents set hard limits on which hours she could use her first cellphone and whom she could contact.\n\nNow as an adult, Shafer tracks her mom's phone. \"It's kind of funny how the tables have turned,\" she said. As her 61-year-old mom has gotten older, checking where she is at least once a day offers some \"peace of mind,\" Shafer says. Her mother doesn't mind the tracking. In fact, they check in on each other and joke about it a lot. \"Sometimes, I just check to see where she's at, and I'm like: 'Hey, are you at the store? Can you grab me this?'\" Shafer said.\n\nStephiney Foley, 37, also had strict parents. Her family immigrated to New York from Shanghai when she was 8. She described her mom and dad's parenting style as \"very typical of overbearing parents, especially immigrant parents.\" Tracking technology wasn't around when Foley was a teen, but her parents still kept a close eye. \"My mom is constantly on my back looking over my shoulders doing things, even when I was in high school,\" Foley told me.\n\nLike Shafer, Foley now tracks her parents, who are in their 60s and 70s. It's typically a safety precaution when they travel. One time her mother got lost driving her RV in the Great Smoky Mountains in Tennessee and Foley was able to help her navigate out of the park.\n\n\"The roles are kind of reversed now in a way that I am kind of the parent,\" she said. Tracking allows Foley, who lives in Seattle, to feel more connected to her Florida-based parents and feel empowered to help in emergencies.\n\nKelley Roebuck, a 46-year-old living in Illinois, installed a tracking app on her son's phone when he was in junior high school to know his whereabouts after he lost his phone twice. At first, it was just a way to keep track of his phone, but it's since morphed into a more central part of their lives. Her son, now 20, tracks her back.\n\n\"One day, I didn't come straight home and he called me, 'Mom, what are you doing at Cousin Erica's house?'\" Roebuck told me. She described her son, who is also her only child, as \"very protective of his friends and family.\" When she used to go out of town often, he would check in when he didn't see her at the hotel or her friend's house.\n\nRoebuck and her son now track each other \"evenly.\" When he is out late, she wants to make sure he's in a safe place. Even her son's best friend, whom Roebuck considers her \"bonus son,\" wanted to share locations with her, so he was added to their Life360 plan in high school.\n\nYears later, her son's friend called Roebuck when she was out late to check in on her. When she asked how he knew where she was, he reminded her he had the tracker.\n\n\"I was like, 'Oh, I forget y'all still had it,\" Roebuck said.\n\nNot all adult children had neutral views on being tracked by their parents when they were younger. Gabrielle Lask, a 25-year-old only child, has been tracked by her mother since she got an iPhone at age 13. Though she said her mom was acting out of love and concern, she also described being tracked as \"incredibly annoying and, at times, a total invasion of privacy.\"\n\n\"I was a very good kid, very trustworthy,\" Lask told me. \"She just has really bad anxiety.\"\n\nLask described her mom as very overprotective; she would often text her about her whereabouts and what she was doing even though she was also tracking her location.\n\nNow that she is older and living independently, Lask has started to push back. \"You're not using this as a safety mechanism anymore,\" she recalled telling her mom a few years ago when she was really upset. \"You're using it as an invasion of privacy.\" Lask temporarily blocked her mom from seeing her location, which she said made her mom \"freak out.\"\n\n\"I basically said, 'I will put you back, but this cannot continue,'\" Lask said. \"'You have to use it as what it's meant to be used for.'\"\n\nThe excessive concern didn't get passed down to Lask. She doesn't track her mom's location -- and she doesn't have much interest in knowing it. \"She doesn't go out much, and if she does, trust and believe, she is texting and calling me nonstop,\" she said. \"I don't worry about her because she worries about me.\"\n\nDr. Kanchi Wijesekera, a clinical psychologist in California, said helicopter parenting through methods like intensive tracking makes kids feel \"suffocating and that parents do not trust them.\" She said it could ultimately add strain to the relationship as kids grow older and start setting boundaries. If kids -- and parents -- don't feel listened to, it can drive a wedge between them.\n\nSometimes, though, those conversations can be transformative in a positive way. When Julianne Goldfinger was 15, her mom ordered paper copies of her texts from their cell provider. Her mom had been worried about how little she knew about Goldfinger's life now that she silently texted her friends -- but it still felt like an invasion of privacy.\n\n\"I was old enough when she did that to kind of push back at her and say, 'You really broke my trust here,'\" Goldfinger, now 35, told me. \"That was a turning point -- my mom realizing that I was growing up and needed some space.\"\n\nGoldfinger and her parents now track each other's locations when they respectively travel, which doesn't bother her since she's been able to have open conversations with her mom.\n\n\"I've really come to find my mom to be more of my friend,\" Goldfinger said.\n\nIncreasingly, parents and their adult kids are staying in closer contact than generations past. One Pew Research study published in January found that over 70% of respondents with children ages 18 to 34 reported speaking with their kids at least a few times a week on the phone. And more parents are tracking their kids in college to help quell their anxiety about the separation.\n\nIt's a big shift from the weekly or monthly check-in phone calls that ruled parent-child relationships in the past. But many families like the extra interaction. For more people, location sharing is simply a way to stay connected.\n\nAfter Howard got over the initial shock of being tracked without her consent, she started to understand the appeal of the tech and began following her children's locations, too.\n\n\"My one daughter, she went out of town just a couple of weeks ago, and I'm watching her come down I-75, and I'm thinking in my mind, 'She's driving awfully fast,'\" Howard said. She added that the mutual tracking gives her peace of mind that her kids aren't in danger.\n\nWijesekera said that attitudes around tracking are shaped by trust and communication. \"If they have a really close bond, it's easier to see those behaviors from a well-intentioned place versus a sign of their lack of trust and wanting to hover and force their decisions on us.\" Kids who grew up being accountable for their whereabouts don't necessarily look back on the memory negatively, so long as they feel their parents trusted them.\n\nThat's certainly true for Joy Loverde. The 72-year-old shares and tracks locations with both her 49-year-old daughter and her two adult grandchildren. \"We jumped on it early on,\" Loverde, who lives in Illinois, told me. \"It was just a matter of wanting to remain even closer.\"\n\nLoverde raised her only daughter on her own, and they've stayed very close -- now Loverde, her daughter, and her daughter's daughter all track one another. They do it partly to check in, and partly just to know more about one another's lives. \"We laugh -- we think it's really funny,\" Loverde said. \"We're poking in and out all the time.\"\n\nFor families like theirs, it's simply a new kind of love language.",
        "source": {
          "uri": "businessinsider.com",
          "dataType": "news",
          "title": "Business Insider"
        },
        "authors": [
          {
            "uri": "julia_pugachevsky@businessinsider.com",
            "name": "Julia Pugachevsky",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://www.tiktok.com/@ilove2giggle2/video/7274580138480651562",
          "https://www.tiktok.com/@the_jcrobinson/video/7274772471444753706",
          "https://www.businessinsider.com/teens-tracking-app-locations-not-stalking-good-parenting-2024-2",
          "https://www.businessinsider.com/dont-track-teen-phone-freedom-parent-worry-2024-3",
          "https://www.businessinsider.com/track-kids-locations-smartphone-pros-cons-2024-2",
          "https://theharrispoll.com/briefs/location-sharing-features/",
          "https://www.businessinsider.com/life360-family-safety-app-sells-user-location-data-report-2021-12",
          "https://www.businessinsider.com/gabb-smartphone-review-teens-kids-social-media-2024-8",
          "https://www.businessinsider.com/gen-z-happy-parents-tracking-location-apps-life360-2023-10",
          "https://www.businessinsider.com/helicopter-parent-son-went-college-2024-5",
          "https://www.theatlantic.com/family/archive/2024/07/modern-parenting-grown-children/678942/",
          "https://www.pewresearch.org/social-trends/2024/01/25/parents-young-adult-children-and-the-transition-to-adulthood/",
          "https://nypost.com/2024/09/04/us-news/next-level-helicopter-parents-track-their-adult-children-interfere-in-roommate-conflicts/"
        ],
        "image": "https://i.insider.com/66f186dfd17aa3c7b2b4f609?width=1200&format=jpeg",
        "eventUri": null,
        "sentiment": -0.04313725490196074,
        "wgt": 465040135,
        "relevance": 1
      },
      {
        "uri": "8337877849",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "09:47:52",
        "dateTime": "2024-09-26T09:47:52Z",
        "dateTimePub": "2024-09-26T09:47:38Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://www.latestly.com/technology/flipkart-big-billion-days-2024-sale-for-flipkart-plus-vip-members-live-now-official-sales-begins-tomorrow-check-discount-on-iphone-15-galaxy-s23-and-more-6296604.html",
        "title": "Flipkart Big Billion Days 2024: Sale for Flipkart Plus, VIP Members Live Now, Official Sales Begins Tomorrow; Check Discount on iPhone 15, Galaxy S23 and More | 📲 LatestLY",
        "body": "Mumbai, September 26: Flipkart Big Billion Days 2024 will officially start on September 27, 2024 (tomorrow), where the customers can buy a wide range of products starting from electronic items, clothing, household items, kitchenware and much more at discounted rates. The Indian e-commerce giant has already opened access to Flipkart Plus members and Flipkart VIP members 24 hours early, from September 26 at midnight. The Flipkart Big Billion Days 2024 is the biggest sale event of the year and the ideal time for customers to buy products ahead of the festive seasons in India.\n\nFlipkart is offering smartphones, laptops, TWS, televisions, refrigerators, home theatres and several other electronic gadgets at a massive discount on its website. Flipkart Big Billion Days will officially end on October 6, 2024, so before that, customers can buy the devices at lower rates. Check out the list of devices available during the Flipkart sale 2024. Flipkart Big Billion Days 2024, Amazon Great Indian Festival Sale 2024, Myntra Big Fashion Festival 2024 Date Announced, Meesho Mega Blockbuster Sale 2024 Coming Soon.\n\nFlipkart's biggest sales event of the year has included brands like Apple, Samsung, Vivo, OPPO, Realme, Nothing, Google, Xiaomi, and Inifnix. According to the official page, Flipkart will offer discounts and offers - bank discounts, extra off on exchange, final sale price, and no-cost EMIs. Currently, the e-commerce giant has featured the following devices on its page - OPPO K12x 5G in Pink Feather Colour at INR 10,999, Infinix Zero 40 5G at INR 24,999, Samsung Galaxy F05 at INR 6,499 and Realme P2 Pro 5G at INR 19,999. All of these devices are available on sale today.\n\nFlipkart has already revealed the discounted prices of some of the smartphones. iPhone 15 Pro and iPhone 15 Pro Max are available on the website at INR 89,900 and INR 1,09,999, respectively, during the Big Billion Days sale. Both devices are available at a massive INR 35,050 exchange offer. iPhone 15 and iPhone 15 Plus will get a massive discount starting September 27. Newly launched iPhone 16 and iPhone 16 Plus are currently available at INR 36,050 exchange bonus. Flipkart Big Billion Days Date Announced; From Sale Date to Deals and Bank Offers, Know What To Expect.\n\nIn addition to the iPhone 16 and 15 series, the Samsung Galaxy S23 is available at INR 37,999 with an exchange offer of up to INR 23,400. The Samsung Galaxy S23 FE 256GB variant is available at INR 32,999, and the 128GB variant is available at INR 29,999. The exchange offers applied to the devices are INR 20,600 and INR 16,800, respectively.\n\n(The above story first appeared on LatestLY on Sep 26, 2024 03:11 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com).",
        "source": {
          "uri": "latestly.com",
          "dataType": "news",
          "title": "LatestLY"
        },
        "authors": [
          {
            "uri": "team_latestly@latestly.com",
            "name": "Team Latestly",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
        ],
        "image": "https://st1.latestly.com/wp-content/uploads/2024/09/84-76-784x441.jpg",
        "eventUri": null,
        "sentiment": 0.2470588235294118,
        "wgt": 465040072,
        "relevance": 3
      },
      {
        "uri": "8337874961",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "09:45:49",
        "dateTime": "2024-09-26T09:45:49Z",
        "dateTimePub": "2024-09-26T09:45:38Z",
        "dataType": "news",
        "sim": 0,
        "url": "https://www.macobserver.com/ipad/install-third-party-app-stores-ipad/",
        "title": "How To Install Third-Party App Stores on iPad",
        "body": "Earlier this month, Apple released iPadOS 18 for supported models. Among other features, the update allows users to install third-party app stores on iPads. That means you're not limited to Apple's marketplace anymore. Here's how to do that and the available alternatives.\n\nIt's important to note that you can only install third-party app stores if you live in the European Union. Users in other countries are still limited to Apple's official solution, a restriction that applies to any kind of app.\n\nFor EU users, installing third-party app stores is almost as simple as installing any app from outside Apple's store. Here are the steps:\n\nThere are a few reasons to use alternative app stores other than Apple's. The main one is that Apple prevents apps distributed through its own marketplace from having a lot of features. One example is clipboard managers: this kind of app is extremely convenient, but the company doesn't allow them.\n\nAnother reason is using payment methods other than Apple's own. The company charges a fee of up to 30% fee for purchases. This includes paid apps, in-app purchases, and subscriptions. Recently, Apple started allowing alternative payment methods, but still charges fees if the app was downloaded from the App Store.\n\nThird-party apps have been available for iOS for some time, now. Because of that, there are already a few app stores you can install on your iPad. Some of these may not be compatible with iPadOS, so you'll have to check for yourself.\n\nIt's important to note that Apple charges a fixed 0.50 Euro fee for each download from the marketplace developers. Some of these stores, for this reason, require paid subscriptions to be used.\n\nSetapp is a subscription-based app store that allows you to use dozens of apps paying a single monthly fee. It has plans that include Macs, iPhones and/or iPads, or all devices.\n\nA known app store for iOS and iPadOS, AltStore focuses on sideloading apps from a computer. AltStore PAL is a version that simplifies the process, allowing users to install applications directly from their iPhone or iPad.\n\nAptoide is mostly known to Android users, as a way to download .APK app installation files. Now, it has a version for iOS and iPadOS as well.\n\nEpic Games is part of why third-party app stores are possible at all. The developers of Unity and Fortnite were among the most vocal opposers of Apple's app distribution and payment policy. This led to legal battles all over the world, many of which are still ongoing.\n\nThe arguments used by Epic and other developers strengthened the push for regulatory changes in the EU. Finally, this forced Apple to open its ecosystem to other marketplaces, and to allow third-party payment methods.\n\nRight now, there aren't many apps in the Epic Games Store. Also, as the name implies, it's focused on games -- and the selection is pretty basic right now. Those looking for other kinds of apps are better served by the previous alternatives.\n\nFor some users, third-party app stores on Apple devices is like a dream come true. For others, it's nothing to care much about. If you're part of the former -- and live in the EU -- , be sure to try it on your iPad.",
        "source": {
          "uri": "macobserver.com",
          "dataType": "news",
          "title": "The Mac Observer"
        },
        "authors": [
          {
            "uri": "bemfica_de_oliva@macobserver.com",
            "name": "Bemfica De Oliva",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://support.apple.com/en-us/118110",
          "https://www.macobserver.com/news/apple-brings-changes-to-its-ecosystem-in-response-to-global-regulatory-pressures/",
          "https://www.macobserver.com/ios/install-apps-outside-app-store/#h-2-downloading-apps-from-developer-websites",
          "https://developer.apple.com/help/app-store-connect/distributing-apps-in-the-european-union/commissions-fees-and-taxes/",
          "https://setapp.com/setapp-mobile",
          "https://support.setapp.com/hc/en-us/articles/115004394569-Subscription-plans",
          "https://altstore.io/#Downloads",
          "https://ios.store.aptoide.com/",
          "https://store.epicgames.com/en-US/mobile/ios"
        ],
        "image": "https://www.macobserver.com/wp-content/uploads/2023/08/Cannot-Verify-Server-Identity-iPad-feature-image.jpg",
        "eventUri": null,
        "sentiment": 0.03529411764705892,
        "wgt": 465039949,
        "relevance": 4
      },
      {
        "uri": "8337874478",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2024-09-26",
        "time": "09:45:33",
        "dateTime": "2024-09-26T09:45:33Z",
        "dateTimePub": "2024-09-26T09:45:21Z",
        "dataType": "news",
        "sim": 0.6274510025978088,
        "url": "https://www.mymobileindia.com/iphone-16-could-be-apples-least-popular-phone-since-iphone-12-says-report/",
        "title": "iPhone 16 Could Be Apple's Least Popular Phone Since iPhone 12, says Report ~ My Mobile India",
        "body": "Morgan Stanley's survey reveals shorter lead times than previous models\n\nThe iPhone 16 series launch was a lacklustre event for many reasons. The reactions to the new iPhones launched and the event in general since then have been mixed. And now if recent reports are to be believed, the iPhone 16 is turning out to be the least popular smartphone in the last 5 years.\n\nAccording to a leaked survey report from Investment Bank Morgan Stanley, iPhone 16 orders are lower than for its predecessors.\n\nTech publication AppleInsider has recently reported that they have seen Morgan Stanley's message to investors revealing details of its lead time survey. According to Apple Insider, the Investment Bank's survey shows iPhone 16 demand is lower than before.\n\nMorgan Stanley has reportedly surveyed lead times for iPhone 16 models and discovered sluggish demand.\n\nAccording to an Apple Insider report, iPhone 16 series lead times on average compared to 2023 are as follows -\n\n\"When we aggregate all of our iPhone lead time data,\" says Morgan Stanley, \"average iPhone 16 lead times from pre-order to today stands at 14 days, shortest amongst all cycles in the last 5 years and roughly in-line with the iPhone 12 cycle.\"\n\nMorgan Stanley further reveals that there is a strong chance that Apple will cut its supply orders following the slow movement of orders. However, it is also specified that early lead times for a product \"still have very limited predictive power.\"\n\nApple Insider report claims, \"Lead times are always dependent on how much stock Apple has -- and Apple never reveals this figure. So it's possible that Apple has done a better job at manufacturing sufficient iPhones for the demand it has.\"\n\nCaption - A graph depicting lead times for different iPhone models. (Image Credit - Morgan Stanley)\n\nThe Lead Time of a product refers to the time taken by manufacturers to deliver the product to the customer after receiving an order.\n\nA shorter lead time usually indicates that the manufacturer has more units ready than the number of orders they are receiving. It is also significant to note that a shorter lead time doesn't necessarily mean the product is not selling.\n\nIn Apple's case, there is always the possibility that the company has accurately predicted the demand and has sufficient units ready in stock. This could be a strategy to ensure a faster delivery.\n\nHistorically speaking, lead times have always been indicative of assessing demands. Shorter lead times often point to a slow demand.\n\nThe iPhone 16 and iPhone 16 Plus have sold close to 37 million units in its first weekend. Certain media reports also claimed Russians have been ordering more than anticipated despite higher price tags for iPhones.\n\nAnswer. The iPhone 16 is reported to have lower orders than its predecessors. Lead times for the iPhone 16 are the shortest in the last 5 years, indicating lower demand compared to previous models.\n\nAnswer. According to Morgan Stanley's survey, iPhone 16 demand is sluggish with shorter lead times. For example, the lead time for the iPhone 16 Pro Max is 25.5 days, down from 43.5 days for the previous year's model.\n\nAnswer. Shorter lead times might also suggest that Apple has efficiently predicted demand and has sufficient stock. However, shorter lead times have historically indicated slower demand.\n\nRead More: iPhone 16 Battery and Charging: How to Fast Charge Your iPhone 16, Check First iPhone 16 Pro Max Battery Test Results",
        "source": {
          "uri": "mymobileindia.com",
          "dataType": "news",
          "title": "My Mobile"
        },
        "authors": [
          {
            "uri": "team_my_mobile@mymobileindia.com",
            "name": "Team My Mobile",
            "type": "author",
            "isAgency": false
          }
        ],
        "links": [
          "https://www.mymobileindia.com/iphone-16-battery-and-charging-how-to-fast-charge-your-iphone-16-check-first-iphone-16-pro-max-battery-test-results/",
          "https://www.mymobileindia.com/iphone-16-and-iphone-16-pro-go-through-early-durability-tests-shows-drawbacks-of-new-ultra-thin-bezels/"
        ],
        "image": "https://www.mymobileindia.com/wp-content/uploads/2024/09/iphone-16.jpg",
        "eventUri": "eng-9928415",
        "sentiment": -0.1450980392156863,
        "wgt": 465039933,
        "relevance": 9
      }
    ],
    "totalResults": 23956,
    "page": 1,
    "count": 20,
    "pages": 3
  }
}